[{"symbol": "BKWO", "assetClass": "Equity", "aum": 16843853, "avgVolume": 104, "cusip": "09661T792", "description": "The fund seeks long-term capital growth, and looks to invest principally in U.S. companies that have attractive financial attributes and promote \"women's opportunities\" - opportunities that can enhance the professional development and advancement of women and/or the ability of women to meet their work or other personal life responsibilities. The fund considers companies that promote women's opportunities to be companies that demonstrate gender equity practices in the workplace and/or that provide products or services that are believed to enhance the lives of women, including female participation in management and board representation, positive benefit programs including family leave and flexible work arrangements, as well as companies that offer products /services that help women meet daily life needs. Provides investors with a growth-oriented investment with the added focus on gender equality and supporting women's opportunities. BNY Mellon ETF Investment Adviser, LLC will make contributions to one or more charitable organizations which seeks to promote opportunities for women and/or girls, in an amount representing at least 10% annually of the management fee. Liquid ETF structure allows investors to buy or sell any time the market is open.", "domicile": "US", "etfCompany": "BNY Mellon", "expenseRatio": 0.5, "inceptionDate": "2023-05-15", "isin": "US09661T7928", "name": "BNY Mellon Women's Opportunities ETF", "nav": 37.43, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 6.02}, {"industry": "Consumer Cyclical", "exposure": 9.48}, {"industry": "Consumer Defensive", "exposure": 5.6}, {"industry": "Energy", "exposure": 2.77}, {"industry": "Financial Services", "exposure": 14.44}, {"industry": "Healthcare", "exposure": 13.1}, {"industry": "Industrials", "exposure": 8}, {"industry": "Real Estate", "exposure": 1.04}, {"industry": "Technology", "exposure": 36.67}, {"industry": "Utilities", "exposure": 2.87}], "website": "https://www.bny.com/investments/us/en/individual/products/etf/fund/bny-mellon-womens-opportunities-etf.html", "holdingsCount": 50}]