[{"symbol": "BUFG", "assetClass": "Target Outcome Strategies®", "aum": 275146226, "avgVolume": 51159, "cusip": "33740U778", "description": "The investment objective of the FT Vest Buffered Allocation Growth ETF (the \"Fund\") is to seek to provide investors with capital appreciation. The Fund seeks to achieve its investment objective by investing in a portfolio of exchange-traded funds (\"ETFs\") that seek to provide investors with returns (before fees and expenses) based on the price return of the SPDR S&P 500 ETF Trust (\"SPY\"), up to a predetermined cap, while providing a defined buffer against losses of SPY over a defined one-year period (the \"Underlying ETFs\"). Under normal market conditions, the Fund will invest substantially all of its assets in Underlying ETFs. The Fund and each Underlying ETF are advised by First Trust Advisors L.P. (\"First Trust\" or the \"Advisor\") and sub-advised by Vest Financial LLC (\"Vest\" or the \"Sub-Advisor\"). PDR Services, LLC (\"PDR\") serves as SPY's sponsor. The investment objective of SPY is to seek to provide investment results that, before expenses, correspond generally to the price and yield performance of the S&P 500 Index. Unlike the Underlying ETFs, the Fund itself does not pursue a defined outcome strategy. The buffer is only provided by the Underlying ETFs and the Fund itself does not provide any stated buffer against losses. The Fund will likely not receive the full benefit of the Underlying ETF buffers and could have limited upside potential. The Fund's returns may be limited to the caps of the Underlying ETFs.", "domicile": "US", "etfCompany": "First Trust", "expenseRatio": 1.05, "inceptionDate": "2021-10-25", "isin": "US33740U7789", "name": "FT Vest Buffered Allocation Growth ETF", "nav": 26.08, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 1.67}, {"industry": "Cash & Others", "exposure": 0.009999999999990905}, {"industry": "Communication Services", "exposure": 9.81}, {"industry": "Consumer Cyclical", "exposure": 10.68}, {"industry": "Consumer Defensive", "exposure": 5.49}, {"industry": "Energy", "exposure": 3.01}, {"industry": "Financial Services", "exposure": 13.61}, {"industry": "Healthcare", "exposure": 9.32}, {"industry": "Industrials", "exposure": 7.76}, {"industry": "Real Estate", "exposure": 2.04}, {"industry": "Technology", "exposure": 34.21}, {"industry": "Utilities", "exposure": 2.39}], "website": "https://www.ftportfolios.com/Retail/Etf/EtfSummary.aspx?Ticker=BUFG", "holdingsCount": 8}]