[{"symbol": "BUFQ", "assetClass": "Target Outcome Strategies®", "aum": 1008435103, "avgVolume": 175243, "cusip": "33740U752", "description": "The investment objective of the FT Vest Laddered Nasdaq Buffer ETF (the \"Fund\") is to seek to provide investors with capital appreciation. The Fund seeks to achieve its investment objective by providing investors with large-cap equity market exposure while attempting to limit downside risk through a laddered portfolio of four FT Vest Nasdaq-100 Buffer ETFs (the \"Underlying ETFs\"). Under normal market conditions, the Fund will invest substantially all of its assets in the Underlying ETFs, which seek to provide investors with returns (before fees, expenses and taxes) that match the price return of the Invesco QQQ TrustSM, Series 1 (\"QQQ\"), up to a predetermined upside cap, while providing a buffer against the first 10% (before fees, expenses and taxes) of QQQ losses, over a defined one-year period. Unlike the Underlying ETFs, the Fund itself does not pursue a target outcome strategy. The buffer is only provided by the Underlying ETFs and the Fund itself does not provide any stated buffer against losses. In order to understand the Fund's strategy and risks, it is important to understand the strategies and risks of the Underlying ETFs.", "domicile": "US", "etfCompany": "First Trust", "expenseRatio": 1, "inceptionDate": "2022-06-14", "isin": "US33740U7524", "name": "FT Vest Laddered Nasdaq Buffer ETF", "nav": 33.73, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 1.29}, {"industry": "Communication Services", "exposure": 16.07}, {"industry": "Consumer Cyclical", "exposure": 13.59}, {"industry": "Consumer Defensive", "exposure": 5.19}, {"industry": "Energy", "exposure": 0.46}, {"industry": "Financial Services", "exposure": 0.42}, {"industry": "Healthcare", "exposure": 4.81}, {"industry": "Industrials", "exposure": 3.44}, {"industry": "Real Estate", "exposure": 0.2}, {"industry": "Technology", "exposure": 53.13}, {"industry": "Utilities", "exposure": 1.4}], "website": "https://www.ftportfolios.com/Retail/Etf/EtfSummary.aspx?Ticker=BUFQ", "holdingsCount": 5}]