[{"symbol": "CDC", "assetClass": "US Equity", "aum": 739307834, "avgVolume": 31453, "cusip": "92647N824", "description": "The VictoryShares US EQ Income Enhanced Volatility Wtd ETF seeks to provide investment results that track the performance of the Nasdaq Victory US Large Cap High Dividend 100 Long/Cash Volatility Weighted Index (the Long/Cash Index) before fees and expenses. Volatility Weighting Methodology Combines fundamental criteria and volatility weighting in an effort to outperform traditional cap-weighted indexing strategies. About the Long/Cash Index The Long/Cash Index tactically reduces its exposure to the equity markets during periods of significant market declines and reinvests when market prices have further declined or rebounded. The Nasdaq Victory US Large Cap High Dividend 100 Long/Cash Volatility Weighted Index is based on the month-end price of the Nasdaq Victory US Large Cap High Dividend 100 Volatility Weighted Index (the “Reference Index”). The exit and reinvestment methodology of the Long/Cash Index is based on the month-end value of the Reference Index relative to its All-Time Highest Daily Closing Value (“AHDCV”). AHDCV is the highest daily closing price the Reference Index has achieved since its inception date.", "domicile": "US", "etfCompany": "Victory Capital", "expenseRatio": 0.46, "inceptionDate": "2014-06-30", "isin": "US92647N8240", "name": "VictoryShares US EQ Income Enhanced Volatility Wtd ETF", "nav": 65.14, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 1.76}, {"industry": "Communication Services", "exposure": 3.96}, {"industry": "Consumer Cyclical", "exposure": 3.6}, {"industry": "Consumer Defensive", "exposure": 21.63}, {"industry": "Energy", "exposure": 11.34}, {"industry": "Financial Services", "exposure": 18.92}, {"industry": "Healthcare", "exposure": 7.63}, {"industry": "Industrials", "exposure": 2.35}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 3.33}, {"industry": "Utilities", "exposure": 25.46}], "website": "https://www.vcm.com/products/victoryshares-etfs/victoryshares-etfs-list/victoryshares-us-eq-income-enhanced-volatility-wtd-etf", "holdingsCount": 102}]