[{"symbol": "CGMS", "assetClass": "Fixed Income", "aum": 3000400000, "avgVolume": 766791, "cusip": "14020Y300", "description": "The fund’s investment objective is to provide a high level of current income. Its secondary investment objective is capital appreciation.Distinguishing Characteristics The fund normally invests at least 80% of its assets in issuers domiciled within the United States. The fund invests primarily in bonds and other debt instruments, which may be represented by derivatives. In seeking to achieve a high level of current income, the fund invests in a broad range of debt securities across the credit spectrum including high-yield corporate debt, investment grade corporate debt and securitized debt. The proportion of securities held by the fund within each of these credit sectors will vary with market conditions and the investment adviser's assessment of their relative attractiveness as investment opportunities. The fund may opportunistically invest in other sectors including, but not limited to, U.S. government debt, municipal debt and non-corporate credit, in response to market conditions.The fund may invest substantially in securities rated Ba1 or below and BB+ or below, or in securities that are unrated but determined to be of equivalent quality by the fund's investment adviser. The fund may invest in certain derivative instruments, such as futures contracts and swaps. The fund may invest in a derivative if, in the opinion of the investment adviser, the expected risks and rewards of the proposed investment are consistent with the investment objective and strategies of the fund.", "domicile": "US", "etfCompany": "Capital Group", "expenseRatio": 0.39, "inceptionDate": "2022-10-24", "isin": "US14020Y3009", "name": "Capital Group U.S. Multi-Sector Income ETF", "nav": 27.63, "navCurrency": "USD", "sectorsList": [{"industry": "Cash & Others", "exposure": 100.00303999999998}], "website": "https://www.capitalgroup.com/advisor/investments/exchange-traded-funds/details/cgms", "holdingsCount": 1246}]