[{"symbol": "CGSD", "assetClass": "Fixed Income", "aum": 1427100000, "avgVolume": 302611, "cusip": "14020Y409", "description": "The fund’s investment objective is to provide current income, consistent with a short duration profile as described in the prospectus and with the preservation of capital.Distinguishing Characteristics The fund will invest primarily in bonds (bonds include any debt instrument and cash equivalents, and may be represented by derivatives). The fund consists primarily of debt securities rated BBB- (or Baa3) or better by Nationally Recognized Statistical Rating Organizations designated by the fund's investment adviser or unrated but determined to be of equivalent quality by the fund's investment adviser. The fund's average portfolio duration is generally expected to be less than 2 years, but may be up to 3 years. The fund primarily invests in debt securities denominated in U.S. dollars, including securities issued and guaranteed by the U.S. government, securities of corporate issuers, asset-backed securities (securities backed by assets such as auto loans, credit card receivables or other providers of credit), mortgage-backed securities and debt securities issued by government sponsored entities and federal agencies and instrumentalities that are not backed by the full faith and credit of the U.S. government.The fund may invest up to 5% in debt securities rated BB+ or Ba1 or below, but with a minimum rating of BB- (or Ba3). The fund may also invest in futures contracts and swaps, which are types of derivatives. A derivative is a financial contract, the value of which is based on the value of an underlying financial asset (such as a stock, bond or currency), a reference rate or a market index. The fund may invest in inflation-linked bonds issued by U.S. and non-U.S. governments, their agencies or instrumentalities, and corporations. Inflation-linked bonds are structured to protect against inflation by linking the bond's principal and interest payments to an inflation index, such as the Consumer Price Index for Urban Consumers, so that principal and interest adjust to reflect changes in the index.", "domicile": "US", "etfCompany": "Capital Group", "expenseRatio": 0.25, "inceptionDate": "2022-10-24", "isin": "US14020Y4098", "name": "Capital Group Short Duration Income ETF", "nav": 25.94, "navCurrency": "USD", "sectorsList": [{"industry": "Cash & Others", "exposure": 100}], "website": "https://www.capitalgroup.com/advisor/investments/exchange-traded-funds/details/cgsd", "holdingsCount": 839}]