[{"symbol": "DBA", "assetClass": "Alternative", "aum": 772000000, "avgVolume": 380062, "cusip": "46140H106", "description": "The Invesco DB Agriculture (Fund) seeks to track changes, whether positive or negative, in the level of the DBIQ Diversified Agriculture Index Excess Return (DBIQ Diversified Agriculture Index ER or Index) plus the interest income from the Fund's holdings of primarily US Treasury securities and money market income less the Fund's expenses. The Fund is designed for investors who want a cost-effective and convenient way to invest in commodity futures. The Index is a rules-based index composed of futures contracts on some of the most liquid and widely traded agricultural commodities. You cannot invest directly in the Index. The Fund and the Index are rebalanced and reconstituted annually in November.This Fund is not suitable for all investors due to the speculative nature of an investment based upon the Fund's trading which takes place in very volatile markets. Because an investment in futures contracts is volatile, such frequency in the movement in market prices of the underlying futures contracts could cause large losses. Please see \"Risk and Other Information\" and the Prospectus for additional risk disclosures.For this fund's qualified notices for IRS Section 1446(f) Rule regarding Publicly Traded Partnerships (PTPs), please visit our ETF tax centerForm 1065 Schedule K-3 FAQ for Invesco DB Funds (Securities Act of 1933)", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.85, "inceptionDate": "2007-01-04", "isin": "US46140H1068", "name": "Invesco DB Agriculture Fund", "nav": 26.21, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 10.7}, {"industry": "Communication Services", "exposure": 7.44}, {"industry": "Consumer Cyclical", "exposure": 11.8}, {"industry": "Consumer Defensive", "exposure": 8.79}, {"industry": "Energy", "exposure": 5.25}, {"industry": "Financial Services", "exposure": 13.73}, {"industry": "Healthcare", "exposure": 16.82}, {"industry": "Industrials", "exposure": 15.19}, {"industry": "Real Estate", "exposure": 1.11}, {"industry": "Technology", "exposure": 6.28}, {"industry": "Utilities", "exposure": 2.9}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=DBA", "holdingsCount": 17}]