[{"symbol": "DFGR", "assetClass": "Real Estate Funds", "aum": 2580176514, "avgVolume": 390714, "cusip": "25434V658", "description": "DFGR is designed to provide exposure to the global broad real estate industry with a particular focus on REITs. The fund actively invests in companies of any size that generate at least 50% of their revenue or have at least 50% of their assets invested in residential, commercial, industrial, or other real estate industries. REITs or REIT-like entities are also eligible for inclusion. Selection is done through an integrated investment approach, with certain securities adjusted or excluded based on several factors, including free float, stock momentum, liquidity, size, relative price, profitability, and costs as per the discretion of the advisor. Final constituents are market cap-weighted, with country or region weights implemented, where applicable. Following the funds global exposure, it aims to purchase securities only from approved markets, as identified by the advisor, and in at least three different countries, including the US. Derivatives may be used to leverage exposure or manage cash. Lending of portfolio securities is permitted to generate additional income.", "domicile": "US", "etfCompany": "Dimensional", "expenseRatio": 0.23, "inceptionDate": "2022-12-06", "isin": "US25434V6589", "name": "Dimensional - Global Real Estate ETF", "nav": 26.8908, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 0}, {"industry": "Consumer Defensive", "exposure": 0}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 0.05}, {"industry": "Healthcare", "exposure": 0}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 99.95}, {"industry": "Technology", "exposure": 0}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.dimensional.com/us-en/funds/dfgr/global-real-estate-etf", "holdingsCount": 466}]