[{"symbol": "DOGG", "assetClass": "Target Income Strategies®", "aum": 44073351, "avgVolume": 13241, "cusip": "33738D846", "description": "FT Vest DJIA Dogs 10 Target Income ETF (the \"Fund\") seeks to provide current income with a secondary objective of providing capital appreciation. Under normal market conditions, the Fund will pursue its objective by investing primarily in common stocks, exchange-traded options (including FLexible EXchange options (\"FLEX Options\")) and short-term U.S. Treasury securities. The Fund seeks to provide exposure to the \"Dogs of the Dow,\" the ten highest dividend-yielding stocks in the Dow Jones Industrial Average (\"DJIA\") on an annual basis. The Fund will purchase securities comprising the Dogs of the Dow and gain synthetic exposure to the price movements of the securities comprising the Dogs of the Dow through the use of a combination of puts, calls and U.S. Treasury securities. The Fund will invest at least 80% of its net assets (plus any borrowings for investment purposes) in securities comprising the \"Dogs of the Dow\" or in options contracts that utilize \"Dogs of the Dow\" constituents as the reference asset. Through its investments in securities comprising the Dogs of the Dow and portfolio of investments that reference the Dogs of the Dow, the Fund seeks to provide exposure to a concentrated portfolio of large-capitalization U.S. equity securities while providing a consistent level of income that, when annualized, is approximately 8% (before fees and expenses) above the annualized yield of the DJIA.", "domicile": "US", "etfCompany": "First Trust", "expenseRatio": 0.75, "inceptionDate": "2023-04-25", "isin": "US33738D8469", "name": "FT Vest DJIA Dogs 10 Target Income ETF", "nav": 20.03, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 9.38}, {"industry": "Consumer Cyclical", "exposure": 9.03}, {"industry": "Consumer Defensive", "exposure": 18.55}, {"industry": "Energy", "exposure": 10.71}, {"industry": "Financial Services", "exposure": 0}, {"industry": "Healthcare", "exposure": 29.6}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 22.72}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.ftportfolios.com/Retail/Etf/EtfSummary.aspx?Ticker=DOGG", "holdingsCount": 42}]