[{"symbol": "DWUS", "assetClass": "Equity", "aum": 115484515, "avgVolume": 1727, "cusip": "00768Y487", "description": "Alpha-Seeking Complement to Broad Based Exposure – Broad based indexes, by their nature, have the good and the bad, the strong and the weak. DWUS seeks to add alpha using Dorsey Wright’s historically successful trend following process and investment modeling that looks to identify the strongest U.S. large cap equity investments from the weaker performers. Active Management Advantage – Many ETFs passively invest owning the majority of the stocks represented in their benchmark index, including those with less than attractive investing attributes. DWUS’s investment process systematically screens the FSM U.S. Core large cap equity universe for investments to include or remove from its highly tactical, active portfolio. U.S. Core Equity Rotation – Owning or even avoiding certain large cap investing styles – equal weight, Nasdaq 100, low volatility, momentum, broad based – is an important determinant of domestic core equity success. Investment styles rotate in and out of season. Sometimes those trends last for years, other times for months. By investing in the highest FSM ranked funds, DWUS seeks to capture the growth of those large cap equity styles demonstrating the strongest relative strength while avoiding the weakest. Systematic Defense – Because we believe avoiding severe losses helps to preserve capital and can contribute to good performance over time, DWUS uses a rules-based approach to tactically add cash or short-term fixed income exposure to the portfolio when momentum indicators are triggered. The temporary defensive position is to try to shield the portfolio from certain catastrophic market types.", "domicile": "US", "etfCompany": "AdvisorShares", "expenseRatio": 1.1, "inceptionDate": "2019-12-25", "isin": "US00768Y4879", "name": "AdvisorShares Dorsey Wright FSM U.S. Core ETF", "nav": 50.87, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 1.04}, {"industry": "Communication Services", "exposure": 7.96}, {"industry": "Consumer Cyclical", "exposure": 8.12}, {"industry": "Consumer Defensive", "exposure": 13.71}, {"industry": "Energy", "exposure": 1.15}, {"industry": "Financial Services", "exposure": 19.45}, {"industry": "Healthcare", "exposure": 8.47}, {"industry": "Industrials", "exposure": 10.27}, {"industry": "Real Estate", "exposure": 6.31}, {"industry": "Technology", "exposure": 12.26}, {"industry": "Utilities", "exposure": 11.27}], "website": "https://advisorshares.com/etfs/DWUS", "holdingsCount": 4}]