[{"symbol": "ETHI.TO", "assetClass": "Equity", "aum": 105750253, "avgVolume": 1707, "cusip": "37991B108", "description": "ETHI allows investors to access a low-carbon footprint and SRI-screened passive global investment portfolio, offering an alignment of investment goals with values. Today, sustainable investing accounts for over USD 30 trillion in assets globally*. In Canada, responsible investments are estimated to total approximately CAD 2.9 trillion – about 50% of the entire Canadian investment industry**. *Global Sustainable Investment Alliance 2023 **2023 Canadian RI Trends Report According to the Responsible Investment Association, almost every historical comparison of SRI versus traditional investment returns points to similar or slightly better long-term risk-adjusted returns when ESG (environmental, social and governance) issues are considered. ETHI seeks to replicate, to the extent possible, the performance of the Nasdaq Future Global Sustainability Leaders USD Index, net of expenses. The Nasdaq Future Global Sustainability Leaders USD Index is designed to provide exposure to the performance of a basket of large-cap equity securities of companies that are global climate change leaders (as measured by their relative carbon efficiency), and are not materially engaged in activities deemed inconsistent with responsible investment considerations. ETHI seeks to hedge the U.S. dollar value of its portfolio to the Canadian dollar at all times.", "domicile": "CA", "etfCompany": "Global X", "expenseRatio": 0.65, "inceptionDate": "2018-10-31", "isin": "CA44054C1068", "name": "Global X Global Sustainability Leaders Index ETF", "nav": 55.39, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0.33}, {"industry": "Communication Services", "exposure": 4.17}, {"industry": "Consumer Cyclical", "exposure": 13.51}, {"industry": "Consumer Defensive", "exposure": 0.67}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 24.5}, {"industry": "Healthcare", "exposure": 11.65}, {"industry": "Industrials", "exposure": 4.87}, {"industry": "Real Estate", "exposure": 3.72}, {"industry": "Technology", "exposure": 36.32}, {"industry": "Utilities", "exposure": 0.26}], "website": "https://www.globalx.ca/product/ETHI", "holdingsCount": 0}]