[{"symbol": "GSY", "assetClass": "Fixed Income", "aum": 2000000, "avgVolume": 698898, "cusip": "46090A887", "description": "The Invesco Ultra Short Duration ETF (Fund) is an actively managed exchange-traded fund (ETF) that seeks to provide returns in excess of cash equivalents while also seeking to provide preservation of capital and daily liquidity. The Fund will invest at least 80% of its total assets in fixed income securities of varying maturities, but with an average duration of less than one year. As of 06/30/2025 the Fund had an overall rating of 4 stars out of 211 funds and was rated 3 stars out of 211 funds, 3 stars out of 187 funds and 4 stars out of 112 funds for the 3-, 5- and 10- year periods, respectively. Source: Morningstar Inc. Ratings are based on a risk-adjusted return measure that accounts for variation in a fund's monthly performance, placing more emphasis on downward variations and rewarding consistent performance. Open-end mutual funds and exchange-traded funds are considered a single population for comparison purposes. Ratings are calculated for funds with at least a three year history. The overall rating is derived from a weighted average of three-, five- and 10-year rating metrics, as applicable, excluding sales charges and including fees and expenses. ©2025 Morningstar Inc. All rights reserved. The information contained herein is proprietary to Morningstar and/or its content providers. It may not be copied or distributed and is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance does not guarantee future results. The top 10% of funds in a category receive five stars, the next 22.5% four stars, the next 35% three stars, the next 22.5% two stars and the bottom 10% one star. Ratings are subject to change monthly. Had fees not been waived and/or expenses reimbursed currently or in the past, the Morningstar rating would have been lower. Ratings for other share classes may differ due to different performance characteristics.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.2, "inceptionDate": "2008-02-11", "isin": "US46090A8870", "name": "Invesco Ultra Short Duration ETF", "nav": 50.12, "navCurrency": "USD", "sectorsList": [{"industry": "Cash & Others", "exposure": 100}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=GSY", "holdingsCount": 327}]