[{"symbol": "HBGD.TO", "assetClass": "Equity", "aum": 22189894, "avgVolume": 777, "cusip": "37893C105", "description": "HBGD provides exposure to global companies directly involved in data development, storage, and management-related services, as well as hardware used in data-intensive applications such as blockchain, offering investors access to the growing field of big data technology. According to Statista, the big data analytics market is expected to surpass US$103 billion in revenue by 2027. Central to this industry growth are hardware and data servicing companies that provide key infrastructure for the development of data-intensive technologies. While HBGD may include cryptocurrency-related companies, it does not directly hold cryptocurrencies like bitcoin or engage in cryptocurrency mining, potentially reducing exposure to the volatility associated with these assets. HBGD seeks to replicate, to the extent possible, the performance of the Solactive Big Data & Hardware Index, net of expenses. The Solactive Big Data and Hardware Index tracks a portfolio of global companies focusing directly on data development, storage, and management-related services and solutions as well as hardware and hardware-related services used in data-intensive applications such as blockchain.", "domicile": "CA", "etfCompany": "Global X", "expenseRatio": 0.64, "inceptionDate": "2018-06-19", "isin": "CA44054U1066", "name": "Global X Big Data & Hardware Index ETF", "nav": 36.3, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Cash & Others", "exposure": 0.009999999999990905}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 1.65}, {"industry": "Consumer Defensive", "exposure": 0}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 23.87}, {"industry": "Healthcare", "exposure": 0}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 3.61}, {"industry": "Technology", "exposure": 70.86}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.globalx.ca/product/HBGD", "holdingsCount": 0}]