[{"symbol": "HMMJ.TO", "assetClass": "Equity", "aum": 47923164, "avgVolume": 8787, "cusip": "37991D104", "description": "HMMJ seeks to closely replicate the performance of the North American Marijuana Index. This index is specifically crafted to offer exposure to a diversified basket of North American publicly listed companies heavily involved in the marijuana industry. Unlike investing in a single marijuana company, HMMJ offers diversified exposure to a basket of North American publicly listed companies within the industry, reducing the risk associated with individual securities while still capturing the potential upside of the sector. With the marijuana industry rapidly evolving, HMMJ is rebalanced quarterly to ensure the portfolio reflects the changing landscape, providing investors with exposure to the industry's shifting leadership and growth drivers. HMMJ seeks to replicate, to the extent possible, the performance of the North American Marijuana Index, net of expenses. The North American Marijuana Index is designed to provide exposure to the performance of a basket of North American publicly listed companies with significant business activities in the marijuana industry", "domicile": "CA", "etfCompany": "Global X", "expenseRatio": 0.98, "inceptionDate": "2017-04-04", "isin": "CA44054J3091", "name": "Global X Marijuana Life Sciences Index ETF", "nav": 7.34, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 11.39}, {"industry": "Cash & Others", "exposure": 0.009999999999990905}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 0.91}, {"industry": "Consumer Defensive", "exposure": 10.88}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 2.07}, {"industry": "Healthcare", "exposure": 57.11}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 15.57}, {"industry": "Technology", "exposure": 2.06}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.globalx.ca/product/HMMJ", "holdingsCount": 0}]