[{"symbol": "HPR.TO", "assetClass": "Equity", "aum": 940085471, "avgVolume": 38915, "cusip": "37892R103", "description": "HPR seeks to provide dividend income while preserving capital by actively investing primarily in preferred shares of Canadian companies. With the flexibility to invest in preferred shares of Canadian and US companies, fixed-income securities of Canadian and US issuers, as well as Canadian equity securities and ETFs that issue index participation units, HPR offers a diversified portfolio designed to enhance risk-adjusted returns and reduce overall portfolio volatility. While each security in HPR's portfolio undergoes extensive independent analysis by the team at Sub-Advisor Fiera Capital, HPR itself is not constrained by an index methodology, as Fiera Capital can choose which preferred shares to buy or sell, and when to buy or sell them. HPR seeks to provide dividend income while preserving capital by investing primarily in preferred shares (including securities convertible into preferred shares) of Canadian companies. HPR may also invest in preferred shares of companies located in the United States, debt securities (including LRCNs) of Canadian and U.S. issuers, other income generating securities, as well as Canadian equity securities and Listed Funds.", "domicile": "CA", "etfCompany": "Global X", "expenseRatio": 0.65, "inceptionDate": "2010-11-21", "isin": "CA44051D1078", "name": "Global X Active Preferred Share ETF", "nav": 10.06, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 0}, {"industry": "Consumer Defensive", "exposure": 0}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 100}, {"industry": "Healthcare", "exposure": 0}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 0}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.globalx.ca/product/HPR", "holdingsCount": 0}]