[{"symbol": "HXCN.TO", "assetClass": "Equity", "aum": 1632367347, "avgVolume": 14314, "cusip": "37964T102", "description": "HXCN offers investors exposure to the performance of the S&P/TSX Capped Composite Index, providing diversified exposure to the broad large-cap market segment of the Canadian equity market, with the weight of any constituent issuer capped at 10%. By providing exposure to the underlying index through a single ETF, HXCN offers investors a cost-effective way to access the Canadian equity market compared to individual stock selection or actively managed funds. This ETF is suitable for an investor looking for total return exposure to the broad large-cap Canadian equity market, who can handle the ups and downs of the stock market, but who is not looking for regular distributions. HXCN seeks to replicate, to the extent possible, the performance of the S&P/TSX Capped Composite Index (Total Return), net of expenses. The S&P/TSX Capped Composite Index (Total Return) is designed to measure the performance of the broad large-cap market segment of the Canadian equity market, with a capped weight of 10% on all Constituent Issuers.", "domicile": "CA", "etfCompany": "Global X", "expenseRatio": 0.05, "inceptionDate": "2020-02-05", "isin": "CA44057A1075", "name": "Global X S&P/TSX Capped Composite Index Corporate Class ETF", "nav": 45.7, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 13.07}, {"industry": "Communication Services", "exposure": 2.24}, {"industry": "Consumer Cyclical", "exposure": 4.1}, {"industry": "Consumer Defensive", "exposure": 3.78}, {"industry": "Energy", "exposure": 16.2}, {"industry": "Financial Services", "exposure": 32.87}, {"industry": "Healthcare", "exposure": 0.11}, {"industry": "Industrials", "exposure": 12.42}, {"industry": "Real Estate", "exposure": 1.96}, {"industry": "Technology", "exposure": 9.66}, {"industry": "Utilities", "exposure": 3.6}], "website": "https://www.globalx.ca/product/HXCN", "holdingsCount": 0}]