[{"symbol": "HXDM.TO", "assetClass": "Equity", "aum": 588814490, "avgVolume": 15117, "cusip": "37963V108", "description": "HXDM offers exposure to the performance of some of the large-cap and mid-cap companies across developed markets including Europe, Australasia and the Far East (excluding the U.S. and Canada). Low-cost, convenient access to EAFE stocks helps investors diversify internationally and seek long-term growth in their portfolios. This ETF is suitable for an investor looking for total return exposure to large and mid-cap securities across 21 developed markets including countries in Europe, Australasia and the Far East, excluding the U.S. and Canada, who can handle the ups and downs of the stock market, but who is not looking for regular distributions. HXDM seeks to replicate, to the extent possible, the performance of the Horizons EAFE Futures Roll Index (Total Return), net of expenses. The Horizons EAFE Futures Roll Index (Total Return) is designed to measure the performance of large and mid-cap securities across 21 developed markets including countries in Europe, Australasia and the Far East, excluding the U.S. and Canada.", "domicile": "CA", "etfCompany": "Global X", "expenseRatio": 0.22, "inceptionDate": "2017-09-26", "isin": "CA44055M1032", "name": "Global X Intl Developed Markets Equity Index Corporate Class ETF", "nav": 53.79, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 7.52}, {"industry": "Cash & Others", "exposure": 0.010000000000005116}, {"industry": "Communication Services", "exposure": 6.17}, {"industry": "Consumer Cyclical", "exposure": 10.15}, {"industry": "Consumer Defensive", "exposure": 11.76}, {"industry": "Energy", "exposure": 3.41}, {"industry": "Financial Services", "exposure": 16.01}, {"industry": "Healthcare", "exposure": 14.39}, {"industry": "Industrials", "exposure": 14.71}, {"industry": "Real Estate", "exposure": 3.14}, {"industry": "Technology", "exposure": 8.84}, {"industry": "Utilities", "exposure": 3.89}], "website": "https://www.globalx.ca/product/HXDM", "holdingsCount": 0}]