[{"symbol": "IMFL", "assetClass": "Equity", "aum": 563600000, "avgVolume": 54237, "cusip": "46138J437", "description": "The Invesco International Developed Dynamic Multifactor ETF (Fund) is based on the FTSE Developed ex US Invesco Dynamic Multifactor Index (Index). The Fund will invest at least 80% of its total assets in securities that comprise the Index. The Index reflects a dynamic combination of factor exposures drawn from constituent stocks of the FTSE Developed ex US Index. The factors targeted may include low volatility, momentum, quality, size and value. The emphasis on each factor is determined by Invesco’s Regime Model which is informed by the economic environment and overall market conditions. The Index is computed using the net return, which withholds applicable taxes for non-resident investors. The Fund and the Index are rebalanced and reweighted monthly based on the Invesco Signal, after the close of the fourth business day of the month. See the prospectus for more information.For Illustrative Purposes Only and does not constitute a recommendation of the suitability of any investment strategy for a particular investor. Factor investing is an investment strategy in which securities are chosen based on certain characteristics and attributes that may explain differences in returns. Factor investing may underperform cap-weighted benchmarks and increase portfolio risk.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.34, "inceptionDate": "2021-02-23", "isin": "US46138J4379", "name": "Invesco International Developed Dynamic Multifactor ETF", "nav": 27.16, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 3.34}, {"industry": "Communication Services", "exposure": 13.26}, {"industry": "Consumer Cyclical", "exposure": 7.4}, {"industry": "Consumer Defensive", "exposure": 12.07}, {"industry": "Energy", "exposure": 0.94}, {"industry": "Financial Services", "exposure": 10.05}, {"industry": "Healthcare", "exposure": 17.68}, {"industry": "Industrials", "exposure": 18.8}, {"industry": "Real Estate", "exposure": 0.45}, {"industry": "Technology", "exposure": 13.59}, {"industry": "Utilities", "exposure": 2.43}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=IMFL", "holdingsCount": 401}]