[{"symbol": "IUS", "assetClass": "Equity", "aum": 639200000, "avgVolume": 78791, "cusip": "46138J742", "description": "The Invesco RAFITM Strategic US ETF (Fund) is based on the Invesco Strategic US Index (Index). The Fund will normally invest at least 80% of its total assets in securities that comprise the Index. The Index is designed to measure the performance of high quality, large-sized US companies. The securities are assigned a business-size score based on the equally-weighted average of sales, operating cash flow, total return of capital and book value over the prior five years or life of the security. For real estate securities, operating cash flow is replaced by funds from operations and book value is replaced by total assets. The securities are then assigned a quality score based on the equally-weighted average of efficiency (ratio of sales-to-assets in the prior year) and growth (percentage change in ratio of sales-to-assets over the prior five years or life of the security). Finally, each eligible security is ranked in descending order by its Business-Size score. For inclusion in the index, securities ranked in the top 90% by Business-Size score are eligible and, of those 80% with the highest Quality score. Securities in the Index are weighted based on their float-adjusted Business-Size scores. The Fund and the Index are reconstituted annually. As of 08/31/2022 the Fund had an overall rating of 5 stars out of 1154 funds and was rated 5 stars out of 1154 funds, N/A stars out of 1082 funds and N/A stars out of 785 funds for the 3-, 5- and 10- year periods, respectively. Source: Morningstar Inc. Ratings are based on a risk-adjusted return measure that accounts for variation in a fund's monthly performance, placing more emphasis on downward variations and rewarding consistent performance. Open-end mutual funds and exchange-traded funds are considered a single population for comparison purposes. Ratings are calculated for funds with at least a three year history. The overall rating is derived from a weighted average of three-, five- and 10-year rating metrics, as applicable, excluding sales charges and including fees and expenses. ©2022 Morningstar Inc. All rights reserved. The information contained herein is proprietary to Morningstar and/or its content providers. It may not be copied or distributed and is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance does not guarantee future results. The top 10% of funds in a category receive five stars, the next 22.5% four stars, the next 35% three stars, the next 22.5% two stars and the bottom 10% one star. Ratings are subject to change monthly. Had fees not been waived and/or expenses reimbursed currently or in the past, the Morningstar rating would have been lower. Ratings for other share classes may differ due to different performance characteristics.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.19, "inceptionDate": "2018-09-11", "isin": "US46138J7422", "name": "Invesco RAFI Strategic US ETF", "nav": 52.61, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 3.3}, {"industry": "Communication Services", "exposure": 13.2}, {"industry": "Consumer Cyclical", "exposure": 12.15}, {"industry": "Consumer Defensive", "exposure": 8.31}, {"industry": "Energy", "exposure": 9.35}, {"industry": "Financial Services", "exposure": 8.22}, {"industry": "Healthcare", "exposure": 13.47}, {"industry": "Industrials", "exposure": 9.47}, {"industry": "Real Estate", "exposure": 0.5326}, {"industry": "Technology", "exposure": 20.81}, {"industry": "Utilities", "exposure": 1.19}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=IUS", "holdingsCount": 548}]