[{"symbol": "IVRA", "assetClass": "Equity", "aum": 13800000, "avgVolume": 4373, "cusip": "46090A788", "description": "The Invesco Real Assets ESG ETF (Fund) is an actively-managed exchanged-traded fund that seeks capital appreciation with a secondary objective of current income. The Fund seeks to achieve its investment objective by investing primarily in exchange-traded equity securities of “real assets” companies located in North America that meet high environmental, social and governance (ESG) standards. To meet these standards, the Fund employs a proprietary ESG screening process on all investment opportunities. First, the Fund screens the issuers in the investment universe for exclusions, such as substantial involvement (i.e. generating more than 0-10% of the issuer’s revenue) in tobacco, alcohol, controversial and conventional weapons, recreational cannabis, extraction of thermal coal, extraction of fossil fuels from unconventional sources, and operations of private prisons. Issuers are also excluded based on their non-compliance with the United Nations Global Compact principals. Next, investment opportunities are evaluated on multiple ESG factors under each individual pillar of the ESG framework and real assets sector. The individual pillars include, but are not limited to: environmental pillar (“E”) factors: natural resources, pollution and waste, supply chain impact, and environmental opportunities; social pillar (“S”) factors: workforce, community, product responsibility, and human rights; governance pillar (“G”) factors: management, shareholders, board of directors, auditors, regulatory issuers, corporate social responsibility strategy, anti-corruption, and business ethics. Each ESG pillar and investment opportunity are considered separately and neither weighs each pillar equally, nor consistently emphasizes one pillar over another. “Real assets” are characterized by having physical attributes, including real estate, infrastructure, natural resources and timber. Real assets companies are considered companies that are either principally engaged in real estate, infrastructure, natural resources or timber industries, or support such businesses.Important Notice Regarding Changes to the Fund’s Structure and Management Fee Effective May 13, 2025, The Fund transitioned from a \"non-transparent\" ETF, which does not publicly disclose its portfolio holdings daily pursuant to an exemptive order from the U.S. Securities and Exchange Commission (the “Order”) to a \"transparent\" ETF that will disclose its portfolio holdings daily and operate in reliance on Rule 6c-11 under the Investment Company Act of 1940, as amended. In connection with this change to a fully “transparent” structure, the Fund will change as follows:The Fund’s investment objective and principal strategies will remain unchanged despite these structural adjustments and fee reduction.For additional information regarding the unique attributes and risks of the ETF, see the Risk & Other Information section below.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.58, "inceptionDate": "2020-12-21", "isin": "US46090A7880", "name": "Invesco Real Assets ESG ETF 1", "nav": 16.27, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 10.34}, {"industry": "Cash & Others", "exposure": 0.010000000000005116}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 3.05}, {"industry": "Consumer Defensive", "exposure": 0.61}, {"industry": "Energy", "exposure": 28.58}, {"industry": "Financial Services", "exposure": 0}, {"industry": "Healthcare", "exposure": 0}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 49.36}, {"industry": "Technology", "exposure": 0}, {"industry": "Utilities", "exposure": 8.05}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=IVRA", "holdingsCount": 55}]