[{"symbol": "IWFG", "assetClass": "Equity", "aum": 12459607, "avgVolume": 1570, "cusip": "45409F751", "description": "IWFG actively invests in US large-cap firms believed to provide an opportunity for achieving superior portfolio returns, also known as growth stocks. The fund focuses on a limited number of holdings, typically the top 25-35 perceived growth companies. Eligible securities initially undergo a qualitative assessment which evaluates their non-financial performance with certain ESG factors. The adviser then utilizes a bottom-up approach in stock selection and targets firms that address market growth opportunities, lead in market share, have competitive advantages, high capital returns, and cash flow growth, and exhibit sound corporate governance. Unlike traditional ETFs, IWFGs non-transparent structure does not disclose its actual holdings daily and instead publishes a proxy portfolio on its website. Actual holdings will be disclosed on a monthly basis with a 30-day lag. IWFG launched beside its sister fund, IWLG, which focuses on the broader US large-cap growth equity space.", "domicile": "US", "etfCompany": "NY Life Investments", "expenseRatio": 0.75, "inceptionDate": "2022-06-23", "isin": "US45409F7511", "name": "NYLI Winslow Focused Large Cap Growth ETF", "nav": 53.0798, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 12.86}, {"industry": "Consumer Cyclical", "exposure": 16.19}, {"industry": "Consumer Defensive", "exposure": 0}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 9.75}, {"industry": "Healthcare", "exposure": 8.61}, {"industry": "Industrials", "exposure": 4.38}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 48.21}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.newyorklifeinvestments.com/etf/nyli-winslow-focused-large-cap-growth-etf-iwfg", "holdingsCount": 29}]