[{"symbol": "IWSZ.L", "assetClass": "Equity", "aum": 315629532, "avgVolume": 10734, "cusip": "", "description": "The Share Class is a share class of a Fund which aims to achieve a return on your investment, through a combination of capital growth and income on the Fund’s assets, which reflects the return of the MSCI World Mid-Cap Equal Weighted Index, the Fund’s benchmark index. The Share Class, via the Fund, invests in equity securities (e.g. shares) that, so far as possible and practicable, make up the benchmark index. The benchmark index aims to reflect the performance characteristics of mid capitalisation equity securities (e.g. shares) within the MSCI World Index (“Parent Index”), with each security being equally weighted within the benchmark index. Market capitalisation is the share price of a company multiplied by the number of shares issued. The Benchmark Index includes the mid capitalisation constituents of the Parent Index but, at each rebalance date, all index constituents are weighted equally, effectively removing the influence of each constituent’s current share price (high or low). This means that, at each index rebalance, the Benchmark Index will have a larger weighting in the smaller mid capitalisation equity securities compared to its Parent Index.", "domicile": "IE", "etfCompany": "IShares", "expenseRatio": 0.3, "inceptionDate": "2014-10-03", "isin": "IE00BP3QZD73", "name": "iShares MSCI World Mid-Cap Equal Weight UCITS ETF", "nav": 52.6, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 6.98}, {"industry": "Communication Services", "exposure": 5.17}, {"industry": "Consumer Cyclical", "exposure": 10.51}, {"industry": "Consumer Defensive", "exposure": 6.58}, {"industry": "Energy", "exposure": 3.44}, {"industry": "Financial Services", "exposure": 14.1}, {"industry": "Healthcare", "exposure": 8.94}, {"industry": "Industrials", "exposure": 19.77}, {"industry": "Real Estate", "exposure": 7.44}, {"industry": "Technology", "exposure": 11.11}, {"industry": "Utilities", "exposure": 5.97}], "website": "https://www.ishares.com/uk/individual/en/products/270057/ishares-msci-world-size-factor-ucits-etf", "holdingsCount": 763}]