[{"symbol": "OMFL", "assetClass": "Equity", "aum": 4000000, "avgVolume": 360785, "cusip": "46138J619", "description": "The Invesco Russell 1000 Dynamic Multifactor ETF (Fund) is based on the Russell 1000 Invesco Dynamic Multifactor Index (Index). The Fund will invest at least 80% of its total assets in the securities that comprise the Index. The Index is constructed using a rules-based approach that re-weights large-cap securities of the Russell 1000 Index according to economic cycles and market conditions, reflected by expansion, slowdown, contraction or recovery. The securities are assigned a multi-factor score from one of five investment styles: value, momentum, quality, low volatility and size. The Fund and Index are reconstituted and rebalanced based on economic indicator signal changes, as frequently as monthly.For Illustrative Purposes Only and does not constitute a recommendation of the suitability of any investment strategy for a particular investor. Factor investing is an investment strategy in which securities are chosen based on certain characteristics and attributes that may explain differences in returns. Factor investing may underperform cap-weighted benchmarks and increase portfolio risk.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.29, "inceptionDate": "2017-11-07", "isin": "US46138J6192", "name": "Invesco Russell 1000 Dynamic Multifactor ETF", "nav": 58.38, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 1.5}, {"industry": "Communication Services", "exposure": 11.85}, {"industry": "Consumer Cyclical", "exposure": 9.66}, {"industry": "Consumer Defensive", "exposure": 11.5}, {"industry": "Energy", "exposure": 1.02}, {"industry": "Financial Services", "exposure": 16.49}, {"industry": "Healthcare", "exposure": 8.34}, {"industry": "Industrials", "exposure": 8.66}, {"industry": "Real Estate", "exposure": 1.05}, {"industry": "Technology", "exposure": 28.14}, {"industry": "Utilities", "exposure": 1.8}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=OMFL", "holdingsCount": 579}]