[{"symbol": "PIE", "assetClass": "Equity", "aum": 102300000, "avgVolume": 30759, "cusip": "46138E867", "description": "The Invesco Dorsey Wright Emerging Markets Momentum ETF (Fund) is based on the Dorsey Wright Emerging Markets Technical Leaders Index (Index). The Fund will generally invest at least 90% of its total assets in securities of emerging economies within Dorsey Wright & Associates' classification definition, as well as American depositary receipts (ADRs) and global depositary receipts (GDRs) based on securities in the Index. The Index includes approximately 100 companies from the Nasdaq Emerging Markets Index that possess powerful relative strength characteristics and are domiciled in emerging market countries including, but not limited to Brazil, Chile, China, India, Indonesia, Philippines, South Africa, Thailand and Turkey. The Index excludes US companies listed on a US stock exchange. The Index is computed using the net return, which withholds applicable taxes for non-resident investors. The Fund and the Index are rebalanced and reconstituted quarterly.Effective after the close of markets on Aug. 25, 2023, the Fund’s name will change from Invesco DWA Emerging Markets Momentum ETF to Invesco Dorsey Wright Emerging Markets Momentum ETF. No other changes were made to the Fund. See the prospectus for more information.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.9, "inceptionDate": "2007-12-27", "isin": "US46138E8672", "name": "Invesco Dorsey Wright Emerging Markets Momentum ETF", "nav": 21.54, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 6.98}, {"industry": "Communication Services", "exposure": 4.91}, {"industry": "Consumer Cyclical", "exposure": 3.14}, {"industry": "Consumer Defensive", "exposure": 8.46}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 26.01}, {"industry": "Healthcare", "exposure": 12.74}, {"industry": "Industrials", "exposure": 9.78}, {"industry": "Real Estate", "exposure": 5.23}, {"industry": "Technology", "exposure": 18.15}, {"industry": "Utilities", "exposure": 4.61}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=PIE", "holdingsCount": 109}]