[{"symbol": "PIZ", "assetClass": "Equity", "aum": 388200000, "avgVolume": 47947, "cusip": "46138E875", "description": "The Invesco Dorsey Wright Developed Markets Momentum ETF (Fund) is based on the Dorsey Wright Developed Markets Technical Leaders Index (Index). The Fund will generally invest at least 90% of its total assets in securities of developed economies within Dorsey Wright & Associates’ classification definition, as well as American depositary receipts (ADRs) and global depositary receipts (GDRs) based on securities in the Index. This Index includes approximately 100 companies from the Nasdaq Developed Markets Ex United States Index that possess powerful relative strength characteristics and are domiciled in developed markets including, but not limited to Australia, Canada, Finland, France, Germany, Hong Kong, Italy, Japan, Norway, Portugal, Singapore, Spain and Switzerland. The Index excludes US companies listed on a US stock exchange. The Index is computed using the net return, which withholds applicable taxes for non-resident investors. The Fund and the Index are rebalanced and reconstituted quarterly.Effective after the close of markets on Aug. 25, 2023, the Fund’s name will change from Invesco DWA Devloped Markets Momentum ETF to Invesco Dorsey Wright Developed Markets Momentum ETF. No other changes were made to the Fund. See the prospectus for more information. As of 06/30/2025 the Fund had an overall rating of 5 stars out of 365 funds and was rated 5 stars out of 365 funds, 5 stars out of 333 funds and 4 stars out of 219 funds for the 3-, 5- and 10- year periods, respectively. Source: Morningstar Inc. Ratings are based on a risk-adjusted return measure that accounts for variation in a fund's monthly performance, placing more emphasis on downward variations and rewarding consistent performance. Open-end mutual funds and exchange-traded funds are considered a single population for comparison purposes. Ratings are calculated for funds with at least a three year history. The overall rating is derived from a weighted average of three-, five- and 10-year rating metrics, as applicable, excluding sales charges and including fees and expenses. ©2025 Morningstar Inc. All rights reserved. The information contained herein is proprietary to Morningstar and/or its content providers. It may not be copied or distributed and is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance does not guarantee future results. The top 10% of funds in a category receive five stars, the next 22.5% four stars, the next 35% three stars, the next 22.5% two stars and the bottom 10% one star. Ratings are subject to change monthly. Had fees not been waived and/or expenses reimbursed currently or in the past, the Morningstar rating would have been lower. Ratings for other share classes may differ due to different performance characteristics.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.8, "inceptionDate": "2007-12-27", "isin": "US46138E8755", "name": "Invesco Dorsey Wright Developed Markets Momentum ETF", "nav": 45.67, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 2.19}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 6.14}, {"industry": "Consumer Defensive", "exposure": 5.8}, {"industry": "Energy", "exposure": 0.55088}, {"industry": "Financial Services", "exposure": 25.57}, {"industry": "Healthcare", "exposure": 6.65}, {"industry": "Industrials", "exposure": 42.41}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 8.33}, {"industry": "Utilities", "exposure": 2.37}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=PIZ", "holdingsCount": 114}]