[{"symbol": "PXF", "assetClass": "Equity", "aum": 2000000, "avgVolume": 137439, "cusip": "46138E743", "description": "The Invesco RAFI Developed Markets ex-U.S. ETF (Fund) is based on the RAFI Fundamental Select Developed ex US 1000 Index (Index). The Fund will generally invest at least 90% of its total assets in securities that comprise the Index as well as American depositary receipts (ADRs) and global depositary receipts (GDRs) that represent securities in the Index. The Index is designed to track the performance of the largest developed market equities (excluding the US), selected based on the following four fundamental measures of firm size: book value, cash flow, sales and dividends. The equities with the highest fundamental strength are weighted according to their fundamental scores. The Index is computed using the net return, which withholds applicable taxes for non-resident investors. The Fund and the Index are reconstituted annually.Effective close of business March 21, 2025, FTSE RAFI Developed ex U.S. 1000 Index (\"Current Underlying Index\") will change to the RAFI Fundamental Select Developed ex-US 1000 Index (\"New Underlying Index\"). The New Underlying Index will replace the Fund ’s Current Underlying Index. The Fund ’s name will change to “Invesco RAFI Markets ex-U.S. ETF”. Additionally, the Fund's management fee will reduce to 43 bps. As of 06/30/2025 the Fund had an overall rating of 4 stars out of 339 funds and was rated 3 stars out of 339 funds, 4 stars out of 320 funds and 4 stars out of 235 funds for the 3-, 5- and 10- year periods, respectively. Source: Morningstar Inc. Ratings are based on a risk-adjusted return measure that accounts for variation in a fund's monthly performance, placing more emphasis on downward variations and rewarding consistent performance. Open-end mutual funds and exchange-traded funds are considered a single population for comparison purposes. Ratings are calculated for funds with at least a three year history. The overall rating is derived from a weighted average of three-, five- and 10-year rating metrics, as applicable, excluding sales charges and including fees and expenses. ©2025 Morningstar Inc. All rights reserved. The information contained herein is proprietary to Morningstar and/or its content providers. It may not be copied or distributed and is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance does not guarantee future results. The top 10% of funds in a category receive five stars, the next 22.5% four stars, the next 35% three stars, the next 22.5% two stars and the bottom 10% one star. Ratings are subject to change monthly. Had fees not been waived and/or expenses reimbursed currently or in the past, the Morningstar rating would have been lower. Ratings for other share classes may differ due to different performance characteristics.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.43, "inceptionDate": "2007-06-24", "isin": "US46138E7435", "name": "Invesco RAFI Developed Markets ex-U.S. ETF", "nav": 58.29, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 8.87}, {"industry": "Communication Services", "exposure": 4.88}, {"industry": "Consumer Cyclical", "exposure": 9.54}, {"industry": "Consumer Defensive", "exposure": 6.71}, {"industry": "Energy", "exposure": 8.67}, {"industry": "Financial Services", "exposure": 25.6}, {"industry": "Healthcare", "exposure": 6.95}, {"industry": "Industrials", "exposure": 15.42}, {"industry": "Real Estate", "exposure": 2.11}, {"industry": "Technology", "exposure": 6.94}, {"industry": "Utilities", "exposure": 4.31}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=PXF", "holdingsCount": 1146}]