[{"symbol": "PXH", "assetClass": "Equity", "aum": 1000000, "avgVolume": 318454, "cusip": "46138E727", "description": "The Invesco RAFI Emerging Markets ETF (Fund) is based on the RAFI Fundamental Select Emerging Markets 350 Index (Index). The Fund will generally invest at least 90% of its total assets in the securities that comprise the Index as well as American Depository Receipts (ADRs) and global depositary receipts (GDRs) that represent securities in the Index. The Index is designed to track the performance of the largest emerging market equities, selected based on the following four fundamental measures of firm size: book value, cash flow, sales and dividends. The equities with the highest fundamental strength are weighted according to their fundamental scores. The Index is computed using the net return, which withholds applicable taxes for non-resident investors. The Fund and the Index are reconstituted annually.Effective close of business March 21, 2025, FTSE RAFI Emerging Index (\"Current Underlying Index\") will change to the RAFI Fundamental Select Emerging Markets 350 Index (\"New Underlying Index\"). The New Underlying Index will replace the Fund’s Current Underlying Index. The Fund’s name will change to “Invesco RAFI Emerging Markets ETF”. Additionally, the Fund's management fee will reduce to 47 bps. As of 06/30/2025 the Fund had an overall rating of 4 stars out of 711 funds and was rated 4 stars out of 711 funds, 4 stars out of 629 funds and 4 stars out of 453 funds for the 3-, 5- and 10- year periods, respectively. Source: Morningstar Inc. Ratings are based on a risk-adjusted return measure that accounts for variation in a fund's monthly performance, placing more emphasis on downward variations and rewarding consistent performance. Open-end mutual funds and exchange-traded funds are considered a single population for comparison purposes. Ratings are calculated for funds with at least a three year history. The overall rating is derived from a weighted average of three-, five- and 10-year rating metrics, as applicable, excluding sales charges and including fees and expenses. ©2025 Morningstar Inc. All rights reserved. The information contained herein is proprietary to Morningstar and/or its content providers. It may not be copied or distributed and is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance does not guarantee future results. The top 10% of funds in a category receive five stars, the next 22.5% four stars, the next 35% three stars, the next 22.5% two stars and the bottom 10% one star. Ratings are subject to change monthly. Had fees not been waived and/or expenses reimbursed currently or in the past, the Morningstar rating would have been lower. Ratings for other share classes may differ due to different performance characteristics.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.47, "inceptionDate": "2007-09-26", "isin": "US46138E7278", "name": "Invesco RAFI Emerging Markets ETF", "nav": 24.04, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 10.1}, {"industry": "Communication Services", "exposure": 7.53}, {"industry": "Consumer Cyclical", "exposure": 11.47}, {"industry": "Consumer Defensive", "exposure": 2.93}, {"industry": "Energy", "exposure": 10.21}, {"industry": "Financial Services", "exposure": 30.53}, {"industry": "Healthcare", "exposure": 0.97841}, {"industry": "Industrials", "exposure": 4.75}, {"industry": "Real Estate", "exposure": 1.8}, {"industry": "Technology", "exposure": 17.25}, {"industry": "Utilities", "exposure": 2.45}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=PXH", "holdingsCount": 438}]