[{"symbol": "PZW.TO", "assetClass": "Equity", "aum": 22710000, "avgVolume": 247, "cusip": "46140D105", "description": "PZW invests primarily in equities of small- and medium-sized companies from developed markets globally. It currently holds securities of Invesco RAFI US 1500 Small-Mid ETF (Nasdaq ticker: PRFZ) and Invesco RAFI Developed Markets ex-US Small-Mid ETF (NYSE Arca ticker: PDN) (collectively, the “Underlying ETFs”). The indices tracked by the Underlying ETFs provide exposure to equities of small-and medium-sized companies from developed markets. Rather than weighting companies by market capitalization, the indices tracked by the Underlying ETFs select securities based on four fundamental factors of company size: adjusted sales, adjusted cash flow, dividends plus buybacks and book value plus intangibles. This ETF may also invest in the securities that comprise the indices tracked by the Underlying ETFs. This ETF has a target allocation of 50% for each of the Underlying ETFs. If, on any given day, based on the previous day’s closing prices, the weight of an Underlying ETF has become less than 49.5% or more than 50.5% of this ETF, then the ETF will rebalance each of the Underlying ETFs back to 50% the next trading day. In addition, the ETF will rebalance each of the Underlying ETFs back to 50% on a monthly basis.", "domicile": "CA", "etfCompany": "Invesco", "expenseRatio": 0.5, "inceptionDate": "2015-05-05", "isin": "CA46140D1050", "name": "PZW Invesco RAFI Global Small-Mid ETF - CAD", "nav": 38.295, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 6.89}, {"industry": "Cash & Others", "exposure": 0.009999999999990905}, {"industry": "Communication Services", "exposure": 3.99}, {"industry": "Consumer Cyclical", "exposure": 12.72}, {"industry": "Consumer Defensive", "exposure": 5.73}, {"industry": "Energy", "exposure": 4.45}, {"industry": "Financial Services", "exposure": 15.01}, {"industry": "Healthcare", "exposure": 8.75}, {"industry": "Industrials", "exposure": 20.36}, {"industry": "Real Estate", "exposure": 9.09}, {"industry": "Technology", "exposure": 10.78}, {"industry": "Utilities", "exposure": 2.22}], "website": "https://www.invesco.com/ca-en/exchange-traded-funds/invesco-rafi-global-small-mid-etf---cad", "holdingsCount": 3541}]