[{"symbol": "RPG", "assetClass": "Equity", "aum": 1000000, "avgVolume": 497249, "cusip": "46137V266", "description": "The Invesco S&P 500 Pure Growth ETF (Fund) is based on the S&P 500 Pure Growth Index (Index). The Fund will invest at least 90% of its total assets in securities that comprise the Index. The Index measures the performance of securities that exhibit strong growth characteristics in the S&P 500 Index. First, each security in the S&P 500 is assigned two “style scores” – one for value and one for growth – based on the characteristics of the issuer. The “value score” is measured using three factors: book-value-to-price ratio, earnings-to-price ratio, and sales-to-price ratio. The “growth score” is measured using three other factors: three-year sales per share growth, the three-year ratio of earnings per share change to price per share, and momentum (the 12-month percentage change in price). The ratio between the growth score and the value score is used to rank each stock as either deep value, blend or deep growth. Only the deep growth stocks are selected and are factor weighted such that securities demonstrating the strongest growth characteristics receive proportionally greater weights. The Fund and the Index are rebalanced annually.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.35, "inceptionDate": "2006-02-28", "isin": "US46137V2667", "name": "Invesco S&P 500 Pure Growth ETF", "nav": 47.55, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 7.43}, {"industry": "Consumer Cyclical", "exposure": 22.64}, {"industry": "Consumer Defensive", "exposure": 0.47391}, {"industry": "Energy", "exposure": 2.78}, {"industry": "Financial Services", "exposure": 9.19}, {"industry": "Healthcare", "exposure": 4.21}, {"industry": "Industrials", "exposure": 21.1}, {"industry": "Real Estate", "exposure": 1.72}, {"industry": "Technology", "exposure": 25.4}, {"industry": "Utilities", "exposure": 5.06}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=RPG", "holdingsCount": 92}]