[{"symbol": "RSPE", "assetClass": "Equity", "aum": 25400000, "avgVolume": 9221, "cusip": "46138G516", "description": "The Invesco ESG S&P 500 Equal Weight ETF (Fund) is based on the S&P 500 Equal Weight Scored & Screened Leaders Select Index (Index). The Fund will invest at least 90% of its total assets in securities that comprise the Index. The Index is designed to measure the equal weighted performance of securities included in the S&P 500 Equal Weight Index that also meet an environmental, social and governance (“ESG”) criteria, while maintaining similar overall industry group weights as the S&P 500 Equal Weight Index. Each security is given an “ESG score” that seeks to identify companies well-equipped to recognize and respond to emerging sustainability opportunities and challenges in the global market. Industry-specific questionnaires are used to analyze companies’ custom industries derived from Global Industry Classification Standard (“GICSS&P 500”). Companies provide up to 1,000 data points in response to the questionnaires which is used to score each company’s performance in relation to each specific ESG subject. If a company chooses not to actively participate in the assessment, it may be assessed based on publicly available information. Companies are ranked from highest to lowest according to their ESG scores, and the top 40% of constituents within each GICS S&P 500 industry group generally are included in the Index. The Fund and the Index are rebalanced quarterly. Effective after close of business February 10, 2025, the S&P 500 Equal Weight ESG Leaders Select Index changed its name to the S&P 500 Equal Weight Scored & Screened Leaders Select Index. The underlying index and methodology remains the same.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.2, "inceptionDate": "2021-11-16", "isin": "US46138G5163", "name": "Invesco ESG S&P 500 Equal Weight ETF", "nav": 28.24, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 5.01}, {"industry": "Communication Services", "exposure": 4.28}, {"industry": "Consumer Cyclical", "exposure": 12.46}, {"industry": "Consumer Defensive", "exposure": 7.54}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 14.94}, {"industry": "Healthcare", "exposure": 12.52}, {"industry": "Industrials", "exposure": 15.84}, {"industry": "Real Estate", "exposure": 6.84}, {"industry": "Technology", "exposure": 16.83}, {"industry": "Utilities", "exposure": 3.73}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=RSPE", "holdingsCount": 188}]