[{"symbol": "SPVM", "assetClass": "Equity", "aum": 64700000, "avgVolume": 7139, "cusip": "46137V423", "description": "The Invesco S&P 500 Value with Momentum ETF (Fund) is based on the S&P 500 High Momentum Value Index (Index). The Fund will invest at least 90% of its total assets in the component securities that comprise the Index. The Index is comprised of 100 securities in the S&P 500 Index having the highest “value scores” and “momentum scores,” calculated pursuant to the index methodology. Underlying Index constituents are weighted by their value scores; securities with higher value scores receive relatively greater weights. The Fund and the Index are rebalanced and reconstituted semi-annually.Financial Professionals - Log in to view the fund’s Factor DNATM chartSource: Axioma, Inc. Factor score methodologyAxioma is used to calculate the data that goes into the charts. We use Axioma's global short time horizon risk model.The current factor exposures of the ETF relative to its benchmark index are shown using the bars in the chart. Each factor's band indicates the +/- one standard deviation exposure of the fund to that factor over the past three years.The bar color is determined by comparing the number of standard deviations the current exposure is from the average three-year exposure. Higher exposures are a bright color, while lower exposures are a dark color.See notes below for factor definitions.Value: Book to price; Small size: Natural log of the total issuer market capitalization average over the last month. Companies with a smaller market cap receive a higher score; Profitability: considers return-on-equity, return-on-assets, cash-flow-to-assets, cash-flow-to-income, gross margin and sales-to-assets; Momentum: cumulative return over last 20 days; Low Volatility: square root of 60-day average of absolute return / cross sectional market volatility. Lower volatility stocks receive a higher score; Leverage: equal weight average of debt-to-assets and debt-to-equity; Growth: equal weight average of earnings growth rate and the sales growth rate; Dividend Yield: trailing 12-month dividend yield.", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.29, "inceptionDate": "2011-06-15", "isin": "US46137V4234", "name": "Invesco S&P 500 Value with Momentum ETF", "nav": 61.66, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 1.96}, {"industry": "Communication Services", "exposure": 6.99}, {"industry": "Consumer Cyclical", "exposure": 10.87}, {"industry": "Consumer Defensive", "exposure": 5.78}, {"industry": "Energy", "exposure": 2.28}, {"industry": "Financial Services", "exposure": 36.84}, {"industry": "Healthcare", "exposure": 6.24}, {"industry": "Industrials", "exposure": 5.72}, {"industry": "Real Estate", "exposure": 2.9}, {"industry": "Technology", "exposure": 5.67}, {"industry": "Utilities", "exposure": 14.75}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=SPVM", "holdingsCount": 101}]