[{"symbol": "UDN", "assetClass": "Alternative", "aum": 151500000, "avgVolume": 275565, "cusip": "46141D104", "description": "The Invesco DB US Dollar Index Bearish (Fund) seeks to track changes, whether positive or negative, in the level of the Deutsche Bank Short USD Currency Portfolio Index - Excess Return (DB Short USD Currency Portfolio Index ER or Index) plus the interest income from the Fund's holdings of primarily US Treasury securities and money market income less the Fund's expenses. The Fund is designed for investors who want a cost effective and convenient way to track the value of the U.S. dollar relative to a basket of the six major world currencies – the euro, Japanese yen, British pound, Canadian dollar, Swedish krona and Swiss franc (collectively, the \"Basket Currencies\"). The Index is a rules-based index composed solely of short U.S. Dollar Index futures contracts that trade on the ICE futures exchange (USDX futures contracts). The USDX futures contract is designed to replicate the performance of being short the U.S. dollar against the Basket Currencies.This Fund is not suitable for all investors due to the speculative nature of an investment based upon the Fund's trading which takes place in very volatile markets. Because an investment in futures contracts is volatile, such frequency in the movement in market prices of the underlying futures contracts could cause large losses. Please see \"Risk and Other Information\" and the Prospectus for additional risk disclosures.For this fund's qualified notices for IRS Section 1446(f) Rule regarding Publicly Traded Partnerships (PTPs), please visit our ETF tax centerForm 1065 Schedule K-3 FAQ for Invesco DB Funds (Securities Act of 1933)", "domicile": "US", "etfCompany": "Invesco", "expenseRatio": 0.75, "inceptionDate": "2007-02-19", "isin": "US46141D1046", "name": "Invesco DB US Dollar Index Bearish Fund", "nav": 18.58, "navCurrency": "USD", "sectorsList": [{"industry": "Cash & Others", "exposure": 100}], "website": "https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Advisor&ticker=UDN", "holdingsCount": 3}]