[{"symbol": "V3AB.L", "assetClass": "Equity", "aum": 846063287, "avgVolume": 252700, "cusip": "G9T180201", "description": "The Fund employs a passive management – or indexing – investment approach, through physical acquisition of securities, and seeks to track the performance of the FTSE Global All Cap Choice Index (the “Index”).The Fund attempts to track the performance of the Index by investing in a representative sample of Index constituent securities.The Index is a market-capitalisation weighted index representing the performance of large, mid, and small-cap stocks of companies located in markets around the world. Market-capitalisation is the value of a company's outstanding shares in the market and shows the size of a company. The Index is constructed from the FTSE Global All Cap Index (the “Parent Index”) which is then screened for certain environmental, social, and governance (i.e. controversy-related) criteria which is independent of Vanguard.Through the screening out of stocks of companies from its portfolio based on the potentially detrimental impact of their conduct or products on society and / or the environment, the Fund promotes certain environmental characteristics and social characteristics relating to social norms and standards.The Index methodology excludes stocks of companies that the sponsor of the Index determines (a) to be engaged or involved in specific activities of the supply chain for, and / or (b) derive revenue (above a threshold specified by the Index provider) from, certain activities relating to the following activities: (a) Vice Products (i.e., adult entertainment, alcohol, gambling, tobacco, cannabis); (b) Non-Renewable Energy (nuclear power, and fossil fuels (which includes: (i) companies that have greater than 50% ownership of companies that own proved or probable reserves in coal, oil or gas, (ii) oil and gas production and supporting services, (iii) coal extraction, production and supporting services, (iv) oil and gas and thermal coal power generation, (v) extraction of arctic oil and gas, and (vi) extraction of oil sands)); and (c) Weapons (chemical &amp; biological weapons, cluster munitions, anti-personnel landmines, nuclear weapons, civilian firearms, and conventional military weapons).The Index provider defines what constitutes “involvement” in each activity. This may be based on percentage of revenue or any connection to a restricted activity regardless of the amount of revenue received, and will relate to specific parts of the supply chain.Company product and conduct involvement is monitored on a yearly basis by the Index provider and as new data is made available to the Index provider.For the full investment strategy please review the prospectus.", "domicile": "IE", "etfCompany": "Vanguard", "expenseRatio": 0.24, "inceptionDate": "2021-03-23", "isin": "IE00BNG8L278", "name": "Vanguard ESG Global All Cap UCITS ETF (USD) Accumulating", "nav": 5.36, "navCurrency": "GBP", "sectorsList": [{"industry": "Basic Materials", "exposure": 2.78}, {"industry": "Communication Services", "exposure": 9.63}, {"industry": "Consumer Cyclical", "exposure": 12.13}, {"industry": "Consumer Defensive", "exposure": 5.12}, {"industry": "Energy", "exposure": 0.00863}, {"industry": "Financial Services", "exposure": 19.27}, {"industry": "Healthcare", "exposure": 10.61}, {"industry": "Industrials", "exposure": 5.99}, {"industry": "Real Estate", "exposure": 3.22}, {"industry": "Technology", "exposure": 30.89}, {"industry": "Utilities", "exposure": 0.35333}], "website": "https://www.nl.vanguard/professional/product/etf/equity/9470/esg-global-all-cap-ucits", "holdingsCount": 5838}]