[{"symbol": "V3GS.L", "assetClass": "Bond", "aum": 983993457, "avgVolume": 12968, "cusip": "G9T180219", "description": "The Fund employs a passive management – or indexing – investment approach, through physical acquisition of securities, and seeks to track the performance of the Bloomberg MSCI Global Corporate Float-Adjusted Liquid Bond Screened Index (the “Index”).The Fund invests in a multi-currency portfolio of investment grade corporate fixed-rate bonds from both developed and emerging market issuers that consists of a representative sample of the component securities of the Index.The Index is constructed from the Bloomberg Global Aggregate Float-Adjusted Corporate Index (the “Parent Index”) which represents a similar investment universe which is then screened for certain environmental, social, and governance (i.e. controversy-related) criteria which is independent of Vanguard. criteria (the “screening criteria&quot;) by Bloomberg as the sponsor of the Index, which is independent of Vanguard.Through the screening out of bonds issued by corporate issuers from its portfolio based on the potentially detrimental impact of the relevant corporate issuer’s conduct or products on society and / or the environment, the Fund promotes certain environmental characteristics and social characteristics relating to social norms and standards.The Index methodology excludes the bonds of corporate issuers that MSCI determines (a) to be engaged in activities in or involved in specific parts of the supply chain for, and/or (b) derive revenue (above a threshold specified by the Index provider) from, certain business segments of activities related to the following: (i) adult entertainment, (ii) alcohol, (iii) gambling, (iv) tobacco, (v) nuclear weapons, (vi) controversial weapons, (vii) conventional weapons, (viii) civilian firearms, (ix) nuclear power, or (x) fossil fuels (which includes thermal coal, oil, gas, oil sands, arctic oil or arctic gas). The index provider defines what constitutes “involvement” in each activity. This may be based on percentage of revenue or any connection to a restricted activity regardless of the amount of revenue received, and will relate to specific parts of the supply chain.Company product and conduct involvement is monitored on a yearly basis by the Index provider and as new data is made available to the Index provider.For the full investment strategy please review the prospectus.", "domicile": "IE", "etfCompany": "Vanguard", "expenseRatio": 0.15, "inceptionDate": "2021-05-20", "isin": "IE00BNDS1T77", "name": "Vanguard ESG Global Corporate Bond UCITS ETF GBP Hedged Accumulating", "nav": 4.98, "navCurrency": "GBP", "sectorsList": [{"industry": "Cash & Others", "exposure": 99.99702}], "website": "https://www.nl.vanguard/professional/product/etf/bond/9476/esg-global-corporate-bond-ucits", "holdingsCount": 5330}]