[{"symbol": "VCEB", "assetClass": "Intermediate-Term Bond", "aum": 867200000, "avgVolume": 38206, "cusip": "921910691", "description": "Seeks to track the performance of the Bloomberg MSCI U.S. Corporate SRI Select Index.Includes U.S. dollar-denominated, investment-grade, fixed-rate, taxable bonds with greater than one year maturity.Screened for certain environmental, social and corporate governance (ESG) criteria.Specifically excludes bonds of companies that the index provider determines engage in, have a specified level of involvement in, and/or derive threshold amounts of revenue from certain activities or business segments related to the following: adult entertainment, alcohol, gambling, tobacco, nuclear weapons, controversial weapons, conventional weapons, civilian firearms, nuclear power, and thermal coal, oil, or gas.Additionally, the index excludes bonds of companies that, as determined by the index provider, do not meet certain standards defined by the index provider with respect to an ESG controversies assessment, as well as companies that do not meet certain diversity criteria.Follows a passively managed, index-sampling approach.Provides current income with high grade credit quality.Important note: The Index excludes the bonds of companies that the Index provider determines engage in (which may include manufacturing, owning, and operating), have a specified level of involvement in, and/or derive threshold amounts of revenue from one or more of the following activities: (i) production, distribution, and retail of adult entertainment materials; (ii) production, distribution, retail, and supply of alcohol related products; (iii) involvement in certain gambling related business activities; (iv) production, distribution, retail, supply, and licensing of, tobacco related products; (v) manufacture of nuclear weapons or key nuclear weapons components; (vi) manufacture of biological and chemical weapons or key biological and chemical weapons components; cluster munitions whole weapons systems, components, or delivery platforms; landmines whole systems or components; or involvement in the production of depleted uranium (DU) weapons, ammunition, and armor; (vii) production of conventional weapons and components or involvement with conventional weapons support systems and services; (viii) production and/or distribution (wholesale or retail) of firearms or small arms ammunition intended for civilian use (companies that cater to the military, government, and law enforcement markets are not included in the foregoing); (ix) ownership or operation of nuclear power plants or active uranium mines; involvement in uranium enrichment and processing; involvement in the design and engineering of nuclear power reactors; or supplying nuclear power activities; and (x) have an industry tie to fossil fuels (thermal coal, oil and gas), in particular, reserve ownership, related revenues and power generation (companies providing evidence of owning metallurgical coal reserves are not included in the foregoing). The level or type of involvement in, or amount of revenue earned from, certain activities or business segments that lead to exclusion by the Index provider can vary from one activity or business segment to another. In addition, the Index methodology excludes the bonds of companies that, as determined by the Index provider, do not meet certain standards defined by the Index provider with respect to an ESG controversies assessment or do not have an ESG controversy assessment score. The ESG controversies assessment measures a company’s involvement in major ESG controversies and how well they adhere to international norms and principles. Where MSCI, the Index provider’s data source, has insufficient or no data available to adequately assess a particular issuer relative to the ESG criteria of the Index, bonds of such issuer may be excluded from the Index until such time as they may be determined to be eligible by MSCI. Additionally, the Index excludes bonds of companies that fail to have at least one woman on their board of directors and companies for which the Index provider does not have board diversity data. The screens for ESG criteria described above do not apply to government-issued bonds (e.g., U.S. Treasury securities), asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities.", "domicile": "US", "etfCompany": "Vanguard", "expenseRatio": 0.12, "inceptionDate": "2020-09-22", "isin": "US9219106914", "name": "Vanguard ESG U.S. Corporate Bond ETF", "nav": 62.92, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0.512253917235836}, {"industry": "Cash & Others", "exposure": 28.967456809963956}, {"industry": "Communication Services", "exposure": 9.250703093611863}, {"industry": "Consumer Cyclical", "exposure": 5.644837284049799}, {"industry": "Consumer Defensive", "exposure": 2.721976697468853}, {"industry": "Financial Services", "exposure": 28.877059059863303}, {"industry": "Healthcare", "exposure": 10.777420650863762}, {"industry": "Industrials", "exposure": 2.1996785857774137}, {"industry": "Real Estate", "exposure": 1.6673362796303683}, {"industry": "Technology", "exposure": 9.31096826034549}, {"industry": "Utilities", "exposure": 0.0703093611892324}], "website": "https://investor.vanguard.com/investment-products/etfs/profile/vceb", "holdingsCount": 268}]