[{"symbol": "VFMF", "assetClass": "Equity", "aum": 356300000, "avgVolume": 18554, "cusip": "921935607", "description": "Advisor uses a rules-based quantitative model to evaluate U.S. common stocks and construct a U.S. equity portfolio that seeks to achieve exposure to multiple factors.After applying an initial screen to remove the most volatile stocks in the universe, stocks are then selected according to their equally weighted ranking across three targeted factors; momentum- stocks that exhibit strong recent performance, quality- stocks that exhibit strong fundamentals, and value- stocks with low prices relative to fundamentals.Portfolio includes a diverse mix of stocks representing many different market capitalizations (large, mid, and small), market sectors, and industry groups, and holds hundreds of names to diversify idiosyncratic stock risk.Portfolio is rebalanced as needed to maintain consistent exposure to the targeted factors.Seeks long-term capital appreciation.Typically, at least 80% of the fund’s assets will be invested in securities issued by U.S. companies.Note: The Value factor is measured by book value/price, forward earnings/price, operating cash flows/price (for non-financials only). The Momentum factor is measured by total returns from month T-12 to month T-1, total returns from month T-7 to month T-1, and the intercept from a 1-year regression of stock returns on their regional benchmark. For financials, the Quality factor is measured by return on equity and share issuance. For non-financials the Quality factor is measured by return on equity, gross profitability, change in net operating assets, and leverage. The volatility screen removes the 20% most volatile names within each market cap grouping and equally across sectors.", "domicile": "US", "etfCompany": "Vanguard", "expenseRatio": 0.18, "inceptionDate": "2018-02-13", "isin": "US9219356071", "name": "Vanguard U.S. Multifactor ETF", "nav": 136.32, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 2.88}, {"industry": "Communication Services", "exposure": 7.59}, {"industry": "Consumer Cyclical", "exposure": 11.53}, {"industry": "Consumer Defensive", "exposure": 8.55}, {"industry": "Energy", "exposure": 5.43}, {"industry": "Financial Services", "exposure": 31.55}, {"industry": "Healthcare", "exposure": 9.65}, {"industry": "Industrials", "exposure": 9.66}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 12.7}, {"industry": "Utilities", "exposure": 0.47}], "website": "https://investor.vanguard.com/investment-products/etfs/profile/vfmf", "holdingsCount": 553}]