[{"symbol": "VGAB.TO", "assetClass": "fixed-income", "aum": 186288522, "avgVolume": 31712, "cusip": "92211F108", "description": "Seeks to employs a “passive management” - or indexing - investment approach designed to track the performance of the Bloomberg Global Aggregate Float Adjusted Composite Index (CAD-Hedged). The Sub-advisor matches this Vanguard ETF’s portfolio investments to the primary risk factors of the applicable Index and seeks to achieve returns that are similar to the applicable Index. This sampling technique is beneficial to this Vanguard ETF, as it is designed to reduce trading costs and avoid having to trade illiquid securities that may be included in the applicable Index. It also uses derivative instruments to seek to hedge the foreign currency exposure of the securities included in the Bloomberg Global Aggregate Float Adjusted Composite Index to the Canadian dollar. In the alternative, this Vanguard ETF may invest all, or substantially all, of its assets in the bonds that make up the applicable Index, holding each bond in approximately the same proportion as its weighting in the Index.", "domicile": "CA", "etfCompany": "Vanguard", "expenseRatio": 0.33, "inceptionDate": "2020-01-17", "isin": "CA92211F1080", "name": "Vanguard Global Aggregate Bond Index ETF (CAD-hedged)", "nav": 21.0242, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Cash & Others", "exposure": 99.46}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 0}, {"industry": "Consumer Defensive", "exposure": 0}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 0.54}, {"industry": "Healthcare", "exposure": 0}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 0}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.vanguard.ca/en/product/etf/fixed-income/9841/vanguard-global-aggregate-bond-index-etf", "holdingsCount": 3}]