[{"symbol": "VTES", "assetClass": "Muni National Short", "aum": 1100000000, "avgVolume": 95585, "cusip": "921935870", "description": "The investment objective of this index fund is to seek to track the performance of a benchmark index that measures the investment-grade segment of the U.S. municipal bond market with maturities between one month and 7 years. The fund employs an indexing investment approach designed to track the S&amp;P 0-7 Year National AMT-Free Municipal Bond Index using a sampling technique to closely match key benchmark characteristics. All of the fund’s investments will be selected through the sampling process, and at least 80% of the fund’s assets will be invested in securities held in the index. Under normal circumstances, at least 80% of the fund’s assets will be invested in securities whose income will be exempt from federal income taxes and the federal alternative minimum tax. Risks of the fund include the fact that changes in interest rates can affect the fund by resulting in lower bond prices (when interest rates go up) or an eventual decrease in income for the fund (when rates decline). Investors who are looking for a fund that may provide federal tax-exempt income and can tolerate moderate price and income fluctuations may wish to consider this fund.With respect to 75% of its total assets, the fund may not: (1) purchase more than 10% of the outstanding voting securities of any one issuer or (2) purchase securities of any issuer if, as a result, more than 5% of the fund’s total assets would be invested in that issuer’s securities; except as may be necessary to approximate the composition of its target index. This limitation does not apply to obligations of the U.S. government or its agencies or instrumentalities.", "domicile": "US", "etfCompany": "Vanguard", "expenseRatio": 0.06, "inceptionDate": "2023-03-07", "isin": "US9219358705", "name": "Vanguard Short-Term Tax-Exempt Bond ETF", "nav": 101.12, "navCurrency": "USD", "sectorsList": [{"industry": "Cash & Others", "exposure": 99.99000000000001}], "website": "https://investor.vanguard.com/investment-products/etfs/profile/vtes", "holdingsCount": 2667}]