[{"symbol": "VUSB", "assetClass": "Short-Term Bond", "aum": 5400000000, "avgVolume": 1282027, "cusip": "92203C303", "description": "The fund’s investment objective is to seek to provide current income while maintaining limited price volatility. The fund invests in a diversified portfolio of high-quality and, to a lesser extent, medium-quality fixed income securities. The fund is expected to maintain a dollar-weighted average maturity of 0 to 2 years. Under normal circumstances, the fund will invest at least 80% of its assets in fixed income securities. The fund is designed to give investors low-cost exposure to money market instruments and short-term high-quality bonds, including asset-backed, government, and investment-grade corporate securities. Although short-term bond funds tend to have a higher yield than money market funds, their share price fluctuates. Because the Ultra-Short Bond ETF will subject investors to principal risk, the fund shouldn’t be viewed as a substitute for a money market fund. Additionally, increases in interest rates can cause the prices of the bonds in the portfolio, and thus the fund’s share price, to decrease.The Ultra-Short Bond ETF is a stand alone product and is separate and distinct from the Vanguard Ultra-Short-Term Bond Fund (VUBFX and VUSFX). Differences in scale, certain investment processes, and underlying holdings are expected to produce different investment returns by the funds.", "domicile": "US", "etfCompany": "Vanguard", "expenseRatio": 0.1, "inceptionDate": "2021-04-05", "isin": "US92203C3034", "name": "Vanguard Ultra-Short Bond ETF", "nav": 49.8, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0.32987747408105605}, {"industry": "Cash & Others", "exposure": 71.07445805843585}, {"industry": "Communication Services", "exposure": 1.4326107445805862}, {"industry": "Consumer Cyclical", "exposure": 1.413760603204526}, {"industry": "Consumer Defensive", "exposure": 1.3949104618284656}, {"industry": "Energy", "exposure": 1.4231856738925563}, {"industry": "Financial Services", "exposure": 10.301602262016974}, {"industry": "Healthcare", "exposure": 1.8378887841658837}, {"industry": "Industrials", "exposure": 2.8557964184731404}, {"industry": "Real Estate", "exposure": 4.109330819981153}, {"industry": "Technology", "exposure": 1.6588124410933103}, {"industry": "Utilities", "exposure": 2.1677662582469397}], "website": "https://investor.vanguard.com/investment-products/etfs/profile/vusb", "holdingsCount": 172}]