[{"symbol": "YOLO", "assetClass": "Equity", "aum": 29548218, "avgVolume": 53819, "cusip": "00768Y495", "description": "Long-Term Upside Potential – The emergence of select cannabis securities and their long-term growth potential adds a compelling element for investors seeking pure cannabis exposure and a potential high-growth complement to a broad-based equity allocation. First Active ETF with Dedicated Cannabis Exposure – YOLO became the first actively managed ETF with dedicated cannabis exposure available in the U.S., which carries inherent advantages. YOLO can adjust its portfolio more quickly than a passive index-based strategy – an important attribute in a rapidly evolving cannabis marketplace that can witness fluctuations and changes among tradeable equities and an influx of new stock issues. Experienced Portfolio Management Team – YOLO’s portfolio management team carries deep experience in the capital markets and a well-established expertise of investing in highly-regulated areas in the equity markets including cannabis. Their risk management and selective approach is an essential feature of YOLO, which does not blindly invest by following a market-cap-weighted index like other cannabis-related ETF offerings.", "domicile": "US", "etfCompany": "AdvisorShares", "expenseRatio": 1.55, "inceptionDate": "2019-04-16", "isin": "US00768Y4952", "name": "AdvisorShares Pure Cannabis ETF", "nav": 2.27, "navCurrency": "USD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 0}, {"industry": "Consumer Defensive", "exposure": 34.09}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 0}, {"industry": "Healthcare", "exposure": 61.75}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 4.16}, {"industry": "Technology", "exposure": 0}, {"industry": "Utilities", "exposure": 0}], "website": "https://advisorshares.com/etfs/YOLO", "holdingsCount": 25}]