[{"symbol": "ZEB.TO", "assetClass": "Equity", "aum": 4288989643, "avgVolume": 1786417, "cusip": "055685101", "description": "BMO Canadian Banks Accelerator ETF seeks to provide unitholders with income and approximately double (2x) the upside return of a Reference Index that gives exposure to equity securities of diversified Canadian banks up to a cap (before fees, expenses and taxes), with approximately single exposure to the downside (before fees, expenses and taxes), over each Target Outcome Period under normal market conditions. The current Reference Index is the Solactive Equal Weight Canada Banks Index. During periods of higher than normal market volatility, BMO Canadian Banks Accelerator ETF may not be able to achieve double (2x) the upside return of the applicable Reference Index in order to comply with applicable regulatory requirements. In order to seek to achieve its investment objectives, BMO Canadian Banks Accelerator ETF will primarily invest in BMO Equal Weight Banks Index ETF (the “Reference ETF”). BMO Canadian Banks Accelerator ETF may also invest in Converge Options that reference the price return of the Reference ETF to employ a “target outcome strategy”. Target outcome strategies seek to produce predetermined investment outcomes based upon the performance of the Reference ETF during the applicable Target Outcome Period. The predetermined outcomes sought by BMO Canadian Banks Accelerator ETF, which include the accelerated return (before fees, expenses and taxes) and a predetermined upside cap (before fees, expenses and taxes), are based on the return of the Reference ETF over the Target Outcome Period. Each Target Outcome Period commences on the first business day of January, April, July and October, and finishes on the last business day of March, June, September and December. The Reference ETF, BMO Equal Weight Banks Index ETF, seeks to replicate, to the extent possible, the performance of an equal weight diversified Canadian bank index, net of expenses. The investment strategy of BMO Equal Weight Banks Index ETF is currently to invest in and hold the constituent securities of the Solactive Equal Weight Canada Banks Index in the same proportion as they are reflected in the Solactive Equal Weight Canada Banks Index. The Manager may also use a sampling methodology in selecting investments for BMO Equal Weight Banks Index ETF to obtain exposure to the performance of the Solactive Equal Weight Canada Banks Index. As an alternative to or in conjunction with investing in and holding all or some of the constituent securities of the Solactive Equal Weight Canada Banks Index, BMO Equal Weight Banks Index ETF may invest in or use Other Securities to obtain exposure to the performance of the Solactive Equal Weight Canada Banks Index. The Solactive Equal Weight Canada Banks Index includes Canadian exchange listed securities in the diversified bank industry. Constituents are subject to minimum market capitalization and liquidity screens. In addition, each security is allocated an equal weight rather than a market capitalization weight.", "domicile": "CA", "etfCompany": "BMO", "expenseRatio": 0.28, "inceptionDate": "2009-10-20", "isin": "CA0556851016", "name": "BMO Equal Weight Banks Index ETF", "nav": 47.42624, "navCurrency": "CAD", "sectorsList": [{"industry": "Basic Materials", "exposure": 0}, {"industry": "Communication Services", "exposure": 0}, {"industry": "Consumer Cyclical", "exposure": 0}, {"industry": "Consumer Defensive", "exposure": 0}, {"industry": "Energy", "exposure": 0}, {"industry": "Financial Services", "exposure": 100}, {"industry": "Healthcare", "exposure": 0}, {"industry": "Industrials", "exposure": 0}, {"industry": "Real Estate", "exposure": 0}, {"industry": "Technology", "exposure": 0}, {"industry": "Utilities", "exposure": 0}], "website": "https://www.bmogam.com/ca-en/products/exchange-traded-fund/bmo-equal-weight-banks-index-etf-zeb/", "holdingsCount": 0}]