[{"symbol": "SOFI", "publishedDate": "2025-07-29 20:15:42", "title": "SoFi Delivered 43.7% Revenue Growth In Q2, I'm Upgrading My Investment Thesis", "image": "https://images.financialmodelingprep.com/news/sofi-delivered-437-revenue-growth-in-q2-im-upgrading-20250729.jpg", "site": "seekingalpha.com", "text": "SoFi Technologies delivered a triple beat with 43.7% YoY revenue growth, raised guidance, and provided clarity on its technology platform, reigniting my very bullish stance. The AWS of fintech narrative is back as SOFI secured Banco Nacion as a Cyberbank client and anticipates 10 new tech deals by Q1 2026. Membership and deposit growth remain outstanding, with 34% YoY member growth and deposits up 28.45% YoY, proving strong customer adoption.", "url": "https://seekingalpha.com/article/4805793-sofi-delivered-strong-revenue-growth-in-q2-im-upgrading-my-investment-thesis"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 17:40:40", "title": "SoFi: Why It's Still Too Early To Take Profits After The Slam-Dunk Quarter?", "image": "https://images.financialmodelingprep.com/news/sofi-why-its-still-too-early-to-take-profits-20250729.jpg", "site": "seekingalpha.com", "text": "SoFi Technologies, Inc. reported killer Q2 earnings, keeping up member and product growth and pushing the stock up as much as 15% during the day. The quarter was so good that SOFI investors are starting to think if it's time to take profits, and we think it's still too early. Members are expected to grow 30% Y/Y this year, adding 3 million members, and products continue to grow in double-digits, which translates to more cross-selling opportunities.", "url": "https://seekingalpha.com/article/4805736-sofi-why-its-still-too-early-to-take-profits-after-the-slam-dunk-quarter"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 17:17:00", "title": "SoFi Technologies, Inc. Announces Public Offering of Common Stock", "image": "https://images.financialmodelingprep.com/news/sofi-technologies-inc-announces-public-offering-of-common-stock-20250729.jpg", "site": "businesswire.com", "text": "SAN FRANCISCO--(BUSINESS WIRE)--SoFi Technologies, Inc. (NASDAQ: SOFI) (“SoFi” or the “Company”) today announced an underwritten public offering of $1.5 billion of shares of its common stock. In connection with the offering, SoFi expects to grant the underwriter a 30-day option to purchase up to an additional 15% of the shares of common stock offered in the offering. All of the shares of common stock in the offering will be sold by SoFi.  SoFi intends to use the net proceeds from the offering f.", "url": "https://www.businesswire.com/news/home/20250729367428/en/SoFi-Technologies-Inc.-Announces-Public-Offering-of-Common-Stock/"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 17:07:54", "title": "SoFi Technologies, Inc. (SOFI) Q2 2025 Earnings Call Transcript", "image": "https://images.financialmodelingprep.com/news/sofi-technologies-inc-sofi-q2-2025-earnings-call-transcript-20250729.jpg", "site": "seekingalpha.com", "text": "SoFi Technologies, Inc. (NASDAQ:SOFI ) Q2 2025 Earnings Call July 29, 2025 8:00 AM ET Company Participants Anthony J. Noto - CEO & Director Christopher Lapointe - Chief Financial Officer Conference Call Participants Andrew William Jeffrey - William Blair & Company L.L.C.", "url": "https://seekingalpha.com/article/4805745-sofi-technologies-inc-sofi-q2-2025-earnings-call-transcript"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 16:54:29", "title": "Stock Market Today: SoFi Rallies 6.6% on Strong Q2 Earnings Beat", "image": "https://images.financialmodelingprep.com/news/stock-market-today-sofi-rallies-66-on-strong-q2-20250729.jpg", "site": "fool.com", "text": "SoFi Technologies (SOFI 6.57%) closed at $22.40, gaining 6.6% on Tuesday, July 29, following the morning release of a robust second-quarter earnings report that exceeded Wall Street expectations. The fintech platform reported Q2 revenue of $858 million, representing 44% year-over-year growth, while delivering earnings per share of $0.08 that topped consensus estimates.", "url": "https://www.fool.com/data-news/2025/07/29/stock-market-sofi-rallies-strong-q2-earnings/"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 14:58:10", "title": "SoFi Appeals to 'Overachievers,' CEO Says", "image": "https://images.financialmodelingprep.com/news/sofi-appeals-to-overachievers-ceo-says-20250729.jpg", "site": "youtube.com", "text": "SoFi CEO Anthony Noto says the company's investment in capital-light businesses has allowed it to boost revenue and offer more appealing products. Noto discusses the company's earnings with Caroline Hyde and Ed Ludlow on “Bloomberg Tech.", "url": "https://www.youtube.com/watch?v=xMnWjtXz0CI"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 14:55:14", "title": "2 Fintech Stocks in Focus After Earnings", "image": "https://images.financialmodelingprep.com/news/2-fintech-stocks-in-focus-after-earnings-20250729.jpg", "site": "schaeffersresearch.com", "text": "Fintech giants PayPal Holdings Inc (NASDAQ:PYPL) and SoFi Technologies Inc (NASDAQ:SOFI) are fresh off the earnings confessional.", "url": "https://www.schaeffersresearch.com/content/news/2025/07/29/2-fintech-stocks-in-focus-after-earnings"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 14:00:12", "title": "SoFi CEO Anthony Noto on the company's crypto strategy", "image": "https://images.financialmodelingprep.com/news/sofi-ceo-anthony-noto-on-the-companys-crypto-strategy-20250729.jpg", "site": "youtube.com", "text": "SoFi's CEO Anthony Noto said Tuesday that recent tech IPOs and excitement around crypto have brought investors back to fintech, helping his company drive 44% year-over-year revenue growth and beating the \"rule of 40.\"", "url": "https://www.youtube.com/shorts/6n1iGnHvimE"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 13:44:07", "title": "Why SoFi Technologies Stock Soared Today", "image": "https://images.financialmodelingprep.com/news/why-sofi-technologies-stock-soared-today-20250729.jpg", "site": "fool.com", "text": "SoFi Technologies (SOFI 10.42%), the San Francisco fintech, soared 14% through 12:50 p.m. ET after beating on the top and bottom lines in its second-quarter earnings report this morning.", "url": "https://www.fool.com/investing/2025/07/29/why-sofi-technologies-stock-soared-today/"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 11:47:20", "title": "SoFi Rides AI, Blockchain Wave as FinTech Fires on All Cylinders", "image": "https://images.financialmodelingprep.com/news/sofi-rides-ai-blockchain-wave-as-fintech-fires-on-20250729.jpg", "site": "pymnts.com", "text": "FinTechs are maturing, evolving and consolidating, creating new growth opportunities.", "url": "https://www.pymnts.com/earnings/2025/sofi-rides-ai-blockchain-wave-fintech-grows/"}, {"symbol": "OPEN", "publishedDate": "2025-07-29 11:44:36", "title": "Why Opendoor Technologies Stock Is Plummeting Today", "image": "https://images.financialmodelingprep.com/news/why-opendoor-technologies-stock-is-plummeting-today-20250729.jpg", "site": "fool.com", "text": "Opendoor Technologies (OPEN -17.31%) stock is getting hit with a surge of selling pressures in Tuesday's trading. The real estate specialist's share price was down 14.1% as of 11:15 a.m.", "url": "https://www.fool.com/investing/2025/07/29/why-opendoor-technologies-stock-is-plummeting-toda/"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 11:42:41", "title": "SoFi CEO Anthony Noto on Q2 earnings, share surge and crypto strategy", "image": "https://images.financialmodelingprep.com/news/sofi-ceo-anthony-noto-on-q2-earnings-share-surge-20250729.jpg", "site": "youtube.com", "text": "Anthony Noto, SoFi CEO, joins 'Money Movers' to discuss Q2 earnings as shares surge for the company, his crypto strategy and U.S. consumer health.", "url": "https://www.youtube.com/watch?v=e2kdwSyLxSc"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 11:39:24", "title": "Live: SoFi Jumps After Announcing Q2 Earnings", "image": "https://images.financialmodelingprep.com/news/live-sofi-jumps-after-announcing-q2-earnings-20250729.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Updates appear automatically as they are published. SoFi Pops After the Bell 9:55 am by Eric Bleeker Trading is open and SoFi shares have popped by more than 16%. Conference Call Highlights 8:53 am by Eric Bleeker SoFi&#8217;s conference call is still going, but here are some of the highlights: Loan Platform Business (LPB) as a Growth Engine Management emphasized strong momentum and capital-light economics, pointing to LPB as a transformative growth driver. Confidence in Multi-Year Growth Targets SoFi reiterated its confidence in 25%+ CAGR through 2026 and EPS of $0.55–$0.80, citing more favorable growth drivers than originally forecasted. Tech Platform Stability Amid Chime Exit While not fully complete, management projected no change in 2025 growth guidance and highlighted 10 new clients expected to contribute in Q1 2026. Key Quotes from SoFi Executives &#8220;Our biggest challenge beyond 2025 is deciding what not to do&#8230; There are more opportunities on the table for us than ever before.&#8221; – Anthony Noto &#8220;We&#8217;re now originating on behalf of others outside our credit box&#8230; a whole new frontier for us.&#8221; – Anthony Noto &#8220;We plan to roll out coaches across our platform to help members understand what they must do, should do, and can do across their financial lives.&#8221; – Anthony Noto &#8220;Margins could be well in excess of 30%&#8230; but we&#8217;re going to keep putting $0.70 of every incremental revenue dollar back into the business.&#8221; – Anthony Noto More from Anthony Noto 8:34 am by Eric Bleeker We @Sofi had an exceptional second quarter with record member and product growth and 44% adjusted net revenue growth – our highest in over 2 years. 29% EBITDA margin. The new rule of 70!! We’re building faster than ever to deliver unmatched value to our members and clients. Thank… pic.twitter.com/Ijq71OhXVx — Anthony Noto (@anthonynoto) July 29, 2025 SoFi&#039;s Conference Call is Bullish 8:14 am by Eric Bleeker SoFi&#8217;s conference call is extremely bullish and likely helping drive the company&#8217;s share price even higher. Here&#8217;s an example of what&#8217;s being said: $SOFI CEO on Q2 Earnings Call: &#8220;Despite the significant growth we have achieved to date, we are just getting started. We are at an unprecedented point in time with two technology supercycles taking place. Crypto and blockchain as well as AI have the power to completely… — Tevis (@FunOfInvesting) July 29, 2025 If that embedded X post doesn&#8217;t load for you, here&#8217;s the full quote from SoFi CEO Anthony Noto: &#8220;&#8221;Despite the significant growth we have achieved to date, we are just getting started. We are at an unprecedented point in time with two technology supercycles taking place. Crypto and blockchain as well as AI have the power to completely reinvent the future of financial services. As a tech forward digital one stop shop, are uniquely positioned to capture the opportunities presented.&#8221;&#8221; SoFI Shares Are on a Tear 8:12 am by Eric Bleeker Wall Street LIKES what it sees from SoFi this morning. SoFi shares are now up 10.6% and the gains keep piling up. We&#8217;ll continue monitoring the stock to see if gains could be even larger once the market opens at 9:30 a.m. ET. SoFi CEO Anthony Noto is Happy 7:55 am by Eric Bleeker Here&#8217;s what SoFi CEO Anthony Noto had to say about today&#8217;s earnings: So proud of our @SoFi team. Leaving it all on the field every day&#8230; head down, no hype, mouth shut just cranking it out and delivering for 8 years for our members. https://t.co/GGruclHqxt — Anthony Noto (@anthonynoto) July 29, 2025 Some Earnings Highlights 7:46 am by Eric Bleeker What are some highlights from this quarter? Fee-based Revenue up 72% to a record $378 million Loan Platform Business originated $2.4 billion in loans Plans to launch blockchain-enabled international money transfers and a return to crypto investing Overall, the company saw a record high in new members and products and an increase in fee-based revenue. These two drivers combined helped push performance beyond Wall Street&#8217;s expectations. New growth initiatives include: Launch of new personal loan product for prime credit card customers New flexible student loan refinancing option In terms of risks, there&#8217;s not a lot to dislike this quarter, but SoFi did see a decrease in multifamily lending. SoFi Now Up 7% In Premarket 7:43 am by Eric Bleeker SoFi Shares are now up 7% in premarket trading. SoFi Technologies reported strong financial results for Q2 2025, with net revenue reaching a record $854.9 million, a 43% increase year-over-year. The company achieved a GAAP net income of $97 million, marking its seventh consecutive quarter of profitability. Adjusted net revenue rose by 44% to $858 million, while adjusted EBITDA increased by 81% to $249 million. SoFi&#8217;s member base grew by 34% to 11.7 million, and product offerings expanded by 34% to 17.1 million. Fee-based revenue also hit a record $377.5 million, driven by robust performance in the Loan Platform Business. The company raised its 2025 guidance, now expecting adjusted net revenue of approximately $3.375 billion and adjusted EBITDA of $960 million. SoFi continues to innovate with new product offerings and plans to launch blockchain-enabled services and AI features. Longer Earnings Summary 7:11 am by Eric Bleeker SOFI | SoFi Technologies Q2&#8217;25 Earnings Highlights: Adj. EPS: $0.08 ; UP +700% YoY Revenue: $854.9M []; UP +43% YoY Net Income: $97.3M []; UP +459% YoY Outlook: Revenue: $3.375B ±N/A [] Management raised its 2025 guidance, expecting adjusted net revenue of approximately $3.375 billion, which is $65 million higher than the previous top end of $3.310 billion. This implies approximately 30% annual growth compared to the prior guidance of 24% to 27%. Q2 Segment Performance: Financial Services Revenue: $362.5M []; UP +106% YoY Technology Platform Revenue: $109.8M []; UP +15% YoY Lending Revenue: $443.5M []; UP +30% YoY Other Key Q2 Metrics: Effective Tax Rate: 26% Net Interest Income: $517.8M; UP +26% YoY Member Growth: 11.7M members; UP +34% YoY Product Growth: 17.1M products; UP +34% YoY Fee-based Revenue: $377.5M; UP +72% YoY Adjusted EBITDA: $249.1M; UP +81% YoY CEO Commentary: Anthony Noto: &#8220;We had an exceptional second quarter, driving durable growth and strong returns through our relentless focus on product innovation and brand building. We accelerated adjusted net revenue growth to 44% year-over-year, the highest level in over two years, driven by record high new members, as well as new products, and an increase in fee-based revenue. This consistent, disciplined investment across our platform, combined with unmatched products and services, uniquely positions us to capture the massive and expanding opportunities ahead. Looking forward, we are focusing on innovating faster than ever before to serve more of our members&#8217; needs and increasing our financial guidance for 2025.&#8221; Strategic Updates: SoFi announced plans to launch blockchain-enabled international money transfers and a return to crypto investing. Additionally, strategic investments and innovations in AI, with upcoming features like &#8220;Cash Coach&#8221;, will give even more members tools to optimize their finances. SoFi (Nasdaq: SOFI) released earnings this morning and the market likes what it sees. Revenue of $855 million topped expectations of $804.4 million EPS of $.08 topped expectations of $.06 And for the full year the company is now projecting: Revenue: $3.375 billion Adjusted EBITDA: $960 million Net Income: $370 million That&#8217;s slightly ahead of Wall Street expectations on the top line and a big beat on profitability. The Street had been modeling $3.290 in 2025 revenue and $890 million in EBITDA. We will continue updating this live blog with analysis and Wall Street&#8217;s reaction&#8217;s to SoFi&#8217;s earnings. The post Live: SoFi Jumps After Announcing Q2 Earnings appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/29/live-sofi-jumps-after-announcing-q2-earnings/"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 11:09:21", "title": "SoFi Technologies Stock Jumps on Q2 Results, Raised Outlook", "image": "https://images.financialmodelingprep.com/news/sofi-technologies-stock-jumps-on-q2-results-raised-outlook-20250729.jpg", "site": "investopedia.com", "text": "SoFi Technologies (SOFI) shares are jumping 15% in intraday trading Tuesday after the personal finance tech firm posted better-than-estimated results and boosted its revenue and earnings outlook.", "url": "https://www.investopedia.com/sofi-technologies-stock-jumps-on-q2-results-raised-outlook-11780786"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 10:35:38", "title": "SoFi Technologies (SOFI) Reports Q2 Earnings: What Key Metrics Have to Say", "image": "https://images.financialmodelingprep.com/news/sofi-technologies-sofi-reports-q2-earnings-what-key-metrics-20250729.jpg", "site": "zacks.com", "text": "Although the revenue and EPS for SoFi Technologies (SOFI) give a sense of how its business performed in the quarter ended June 2025, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers.", "url": "https://www.zacks.com/stock/news/2633495/sofi-technologies-sofi-reports-q2-earnings-what-key-metrics-have-to-say?cid=CS-STOCKNEWSAPI-FT-fundamental_analysis|nfm-2633495"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 10:05:10", "title": "Buy Or Sell SOFI Stock At $24?", "image": "https://images.financialmodelingprep.com/news/buy-or-sell-sofi-stock-at-24-20250729.jpg", "site": "forbes.com", "text": "SoFi Technologies stock (NASDAQ:SOFI) surged 14% in early trading on Tuesday, July 29, after the announcement of strong Q2 earnings. The firm disclosed earnings of $0.08 per share on revenue of $855 million, considerably surpassing Wall Street's projections of $0.06 per share and $804 million, respectively.", "url": "https://www.forbes.com/sites/greatspeculations/2025/07/29/buy-or-sell-sofi-stock-at-24/"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 09:45:04", "title": "NVO Plunges 20% After Cutting Outlook, SOFI Rallies 10% After Earnings", "image": "https://images.financialmodelingprep.com/news/nvo-plunges-20-after-cutting-outlook-sofi-rallies-10-20250729.jpg", "site": "youtube.com", "text": "Tuesday morning showed a tale of two companies. Novo Nordisk (NVO) sold off more than 20% after making heavy reductions to sales guidance for its Ozempic and Wegovy weight loss drugs.", "url": "https://www.youtube.com/watch?v=WYTNXQOKtQY"}, {"symbol": "STAI", "publishedDate": "2025-07-29 09:21:00", "title": "ScanTech AI Unlocks Potential $100M Market Opportunity Through TIPS Procurement Contract with Creeksource Consulting", "image": "https://images.financialmodelingprep.com/news/scantech-ai-unlocks-potential-100m-market-opportunity-through-tips-20250729.jpg", "site": "globenewswire.com", "text": "New Procurement Pathway Enhances Access to ScanTech AI Solutions for Public Sector Agencies Nationwide Through TIPS Cooperative New Procurement Pathway Enhances Access to ScanTech AI Solutions for Public Sector Agencies Nationwide Through TIPS Cooperative", "url": "https://www.globenewswire.com/news-release/2025/07/29/3123332/0/en/ScanTech-AI-Unlocks-Potential-100M-Market-Opportunity-Through-TIPS-Procurement-Contract-with-Creeksource-Consulting.html"}, {"symbol": "SOFI", "publishedDate": "2025-07-29 09:10:22", "title": "SoFi Technologies, Inc. (SOFI) Q2 Earnings and Revenues Surpass Estimates", "image": "https://images.financialmodelingprep.com/news/sofi-technologies-inc-sofi-q2-earnings-and-revenues-surpass-20250729.jpg", "site": "zacks.com", "text": "SoFi Technologies, Inc. (SOFI) came out with quarterly earnings of $0.08 per share, beating the Zacks Consensus Estimate of $0.06 per share. This compares to earnings of $0.01 per share a year ago.", "url": "https://www.zacks.com/stock/news/2633082/sofi-technologies-inc-sofi-q2-earnings-and-revenues-surpass-estimates?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_4-2633082"}, {"symbol": "BINI", "publishedDate": "2025-07-29 08:45:00", "title": "Bollinger Innovations Strengthens Balance Sheet by Eliminating all Warrants and $25.3 Million of Convertible Notes", "image": "https://images.financialmodelingprep.com/news/bollinger-innovations-strengthens-balance-sheet-by-eliminating-all-warrants-20250729.jpg", "site": "globenewswire.com", "text": "Company increases shareholder equity by approximately $133 million Company expects shareholder equity to exceed Nasdaq listing requirements BREA, Calif., July 29, 2025 (GLOBE NEWSWIRE) -- via IBN – Bollinger Innovations, Inc. (NASDAQ: BINI) (“Bollinger Innovations” or the “Company”), an emerging electric vehicle (“EV”) manufacturer, announces today that the Company has eliminated all warrants and $25.3 million of convertible notes, strengthening its balance sheet.", "url": "https://www.globenewswire.com/news-release/2025/07/29/3123240/0/en/Bollinger-Innovations-Strengthens-Balance-Sheet-by-Eliminating-all-Warrants-and-25-3-Million-of-Convertible-Notes.html"}]