[{"symbol": "HCTI", "price": 0.0508, "beta": 0.87, "volAvg": 544212604, "mktCap": 20749036, "lastDiv": 0, "range": "0.006-1.9", "changes": -0.0071, "companyName": "Healthcare Triangle, Inc.", "currency": "USD", "cik": "0001839285", "isin": "US42227W2070", "cusip": "42227W108", "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Medical - Healthcare Information Services", "website": "https://www.healthcaretriangle.com", "description": "Healthcare Triangle, Inc., a healthcare information technology company, focuses on developing solutions in the sectors of cloud services, data science, and professional and managed services. It provides a suite of software, solutions, platforms, and services that enables healthcare and pharma organizations to deliver personalized healthcare, precision medicine, advances in drug discovery, development and efficacy, collaborative research and development, respond to evidence, and enhance the digital transformation. The company's software platforms include CloudEz, an enterprise multi-cloud transformation and management platform that enables customers to manage their cloud infrastructure across private, hybrid, and public cloud infrastructures; and DataEz, a cloud-based data analytics and data science platform for the data analytics and data science requirements of life sciences/pharmaceutical and healthcare provider organizations. It also provides Readabl.AI, a Software-as-a-Service solution that uses public cloud artificial intelligence and machine learning to recognize and extract healthcare information from documents, faxes, and narrative reports. In addition, it offers cloud IT services; and healthcare IT services, such as electronic health records and software implementation, optimization, and extension to community partners, as well as application managed services, and backup and disaster recovery on public cloud. The company primarily serves healthcare delivery organizations, healthcare insurance companies, pharmaceutical and life sciences, biotech companies, and medical device manufacturers. Healthcare Triangle, Inc. was incorporated in 2019 and is based in Pleasanton, California. Healthcare Triangle, Inc. operates as a subsidiary of SecureKloud Technologies, Inc.", "ceo": "Lakshmanan Kannappan", "sector": "Healthcare", "country": "US", "fullTimeEmployees": "36", "phone": "925 270 4812", "address": "4309 Hacienda Drive", "city": "Pleasanton", "state": "CA", "zip": "94588", "dcfDiff": 1.99345, "dcf": -0.01344831111154944, "image": "https://images.financialmodelingprep.com/symbol/HCTI.png", "ipoDate": "2021-10-13", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "STAI", "price": 1.19, "beta": -0.901, "volAvg": 6419434, "mktCap": 30475305, "lastDiv": 0, "range": "0.62-12.19", "changes": 0.521, "companyName": "ScanTech AI Systems Inc.", "currency": "USD", "cik": "0001994624", "isin": null, "cusip": "80603V104", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Construction Materials", "website": "https://www.scantechais.com", "description": "ScanTech AI Systems Inc. develops systems, software, and artificial intelligence solutions for security checkpoints. The company offers SENTINEL CT, a checkpoint baggage inspection system; and ALL SECURE, a multi-energy cargo inspection system. It serves a range of critical infrastructure industries. The company was founded in 2011 and is based in Buford, Georgia.", "ceo": "Dolan P. Falconer Jr.", "sector": "Basic Materials", "country": "US", "fullTimeEmployees": "15", "phone": "470-655-0886", "address": "1735 Enterprise Drive", "city": "Buford", "state": "DE", "zip": "30518-3319", "dcfDiff": 0.82326, "dcf": -0.14796049169606207, "image": "https://images.financialmodelingprep.com/symbol/STAI.png", "ipoDate": "2023-03-15", "defaultImage": true, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SOFI", "price": 22.4, "beta": 1.921, "volAvg": 68236296, "mktCap": 24760064000, "lastDiv": 0, "range": "6.01-25.11", "changes": 1.38, "companyName": "SoFi Technologies, Inc.", "currency": "USD", "cik": "0001818874", "isin": "US83406F1021", "cusip": "83406F102", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Financial - Credit Services", "website": "https://www.sofi.com", "description": "SoFi Technologies, Inc. provides digital financial services. It operates through three segments: Lending, Technology Platform, and Financial Services. The company's lending and financial services and products allows its members to borrow, save, spend, invest, and protect their money. It offers student loans; personal loans for debt consolidation and home improvement projects; and home loans. The company also provides cash management, investment, and technology services. In addition, it operates Galileo, a technology platform that offers services to financial and non-financial institutions; and Apex, a technology enabled platform that provides investment custody and clearing brokerage services, as well as Technisys, a cloud-based digital multi-product core banking platform. The company was founded in 2011 and is headquartered in San Francisco, California.", "ceo": "Anthony J. Noto", "sector": "Financial Services", "country": "US", "fullTimeEmployees": "5000", "phone": "855 456 7634", "address": "234 1st Street", "city": "San Francisco", "state": "CA", "zip": "94105", "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SOFI.png", "ipoDate": "2021-01-04", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SOXS", "price": 7.2, "beta": -4.39, "volAvg": 146586462, "mktCap": 1301918364, "lastDiv": 0.77701, "range": "6.85-53.43", "changes": -0.03, "companyName": "Direxion Daily Semiconductor Bear 3X Shares", "currency": "USD", "cik": "0001424958", "isin": "US25460G1123", "cusip": "25460G336", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Asset Management - Leveraged", "website": null, "description": "The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund's net assets (plus borrowing for investment purposes). The index is a rules-based, modified float-adjusted market capitalization-weighted index that tracks the performance of the thirty largest U.S. listed semiconductor companies. The fund is non-diversified.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": null, "state": "DE", "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SOXS.png", "ipoDate": "2010-03-11", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "BINI", "price": 0.057, "beta": -9.091, "volAvg": 44032117, "mktCap": 600723, "lastDiv": 0, "range": "0.05-79200000", "changes": -0.0076, "companyName": "Bollinger Innovations, Inc.", "currency": "USD", "cik": "0001499961", "isin": "US62526P4063", "cusip": "62526P604", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Auto - Manufacturers", "website": null, "description": "EV manufacturer focused on commercial Class 1, 3, and 4 vehicles. Rebranded from Mullen Automotive to integrate operations under the Bollinger brand, including B4 Class 4 truck production.", "ceo": null, "sector": "Consumer Cyclical", "country": "US", "fullTimeEmployees": "118", "phone": "7146131900", "address": null, "city": "Brea", "state": "CA", "zip": "92821", "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/BINI.png", "ipoDate": "2017-07-31", "defaultImage": true, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "CLDI", "price": 0.6317, "beta": 0.937, "volAvg": 17456467, "mktCap": 21806650, "lastDiv": 0, "range": "0.203-3.89", "changes": 0.0821, "companyName": "Calidi Biotherapeutics, Inc.", "currency": "USD", "cik": "0001855485", "isin": "US3207033099", "cusip": "320703309", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Biotechnology", "website": "https://calidibio.com", "description": "Calidi Biotherapeutics, Inc., a clinical stage immuno-oncology company, engages in developing immunotherapies for the treatment of cancer. It engages in advancing a potent allogeneic stem cell capable of carrying an anti-tumor payload for use in multiple oncology indications, including high-grade gliomas and solid tumors. The company's cell-based delivery platforms are designed to protect, amplify, and potentiate oncolytic viruses leading to enhanced efficacy and improved patient safety. Its pipeline of products candidates in the clinic includes NeuroNova that are allogeneic neural stem cells loaded with an oncolytic adenovirus for the treatment of high-grade gliomas; and SuperNova, which are allogeneic adipose-derived mesenchymal stem cells loaded with tumor-selective CAL1 oncolytic vaccinia virus for the treatment of advanced metastatic solid tumors. The company was founded in 2014 and is based in San Diego, California.", "ceo": "Eric E. Poma", "sector": "Healthcare", "country": "US", "fullTimeEmployees": "28", "phone": "858 794 9600", "address": "4475 Executive Drive", "city": "San Diego", "state": "CA", "zip": "92121", "dcfDiff": 0.39082, "dcf": 0.31917551530293564, "image": "https://images.financialmodelingprep.com/symbol/CLDI.png", "ipoDate": "2021-11-01", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "NVDA", "price": 175.51, "beta": 2.131, "volAvg": 193090924, "mktCap": 4282444000000, "lastDiv": 0.04, "range": "86.62-179.38", "changes": -1.24, "companyName": "NVIDIA Corporation", "currency": "USD", "cik": "0001045810", "isin": "US67066G1040", "cusip": "67066G104", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Semiconductors", "website": "https://www.nvidia.com", "description": "NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds. Its Compute & Networking segment provides Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; cryptocurrency mining processors; Jetson for robotics and other embedded platforms; and NVIDIA AI Enterprise and other software. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, independent software vendors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. It has a strategic collaboration with Kroger Co. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.", "ceo": "Jen-Hsun Huang", "sector": "Technology", "country": "US", "fullTimeEmployees": "36000", "phone": "408 486 2000", "address": "2788 San Tomas Expressway", "city": "Santa Clara", "state": "CA", "zip": "95051", "dcfDiff": 31.33207, "dcf": 145.11782710944917, "image": "https://images.financialmodelingprep.com/symbol/NVDA.png", "ipoDate": "1999-01-22", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "NVO", "price": 53.94, "beta": 0.219, "volAvg": 11149663, "mktCap": 246822979930, "lastDiv": 1.61185, "range": "53.51-139.74", "changes": -15.06, "companyName": "Novo Nordisk A/S", "currency": "USD", "cik": "0000353278", "isin": "US6701002056", "cusip": "670100205", "exchange": "New York Stock Exchange", "exchangeShortName": "NYSE", "industry": "Drug Manufacturers - General", "website": "https://www.novonordisk.com", "description": "Novo Nordisk A/S, together with its subsidiaries, engages in the research and development, manufacture, and distribution of pharmaceutical products in Europe, the Middle East, Africa, Mainland China, Hong Kong, Taiwan, North America, and internationally. It operates in two segments, Diabetes and Obesity Care, and Rare Disease. The Diabetes and Obesity care segment provides products for diabetes, obesity, cardiovascular, and other emerging therapy areas. The Rare Disease segment offers products in the areas of rare blood disorders, rare endocrine disorders, and hormone replacement therapy. The company also provides insulin pens, growth hormone pens, and injection needles. In addition, it offers smart solutions for diabetes treatment, such as smart insulin pens and Dose Check, an insulin dose guidance application. The company has a collaboration agreement with UNICEF to tackle childhood obesity; and with Valo Health, Inc. to discover and develop novel drug programmes for cardiometabolic space. Novo Nordisk A/S was founded in 1923 and is headquartered in Bagsvaerd, Denmark.", "ceo": "Lars Fruergaard Jorgensen", "sector": "Healthcare", "country": "DK", "fullTimeEmployees": "77406", "phone": "45 44 44 88 88", "address": "Novo Alle 1", "city": "Bagsvaerd", "state": null, "zip": "2880", "dcfDiff": -157.01532, "dcf": 237.405318808673, "image": "https://images.financialmodelingprep.com/symbol/NVO.png", "ipoDate": "1981-04-30", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": true, "isFund": false}, {"symbol": "AMD", "price": 177.44, "beta": 2.045, "volAvg": 49760232, "mktCap": 287701216000, "lastDiv": 0, "range": "76.48-182.31", "changes": 3.78, "companyName": "Advanced Micro Devices, Inc.", "currency": "USD", "cik": "0000002488", "isin": "US0079031078", "cusip": "007903107", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Semiconductors", "website": "https://www.amd.com", "description": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides processors for desktop and notebook personal computers under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, AMD FX, AMD A-Series, and AMD PRO A-Series processors brands; discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics, AMD Embedded Radeon graphics brands; and professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands. It also offers Radeon Instinct, Radeon PRO V-series, and AMD Instinct accelerators for servers; chipsets under the AMD trademark; microprocessors for servers under the AMD EPYC; embedded processor solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. The company was incorporated in 1969 and is headquartered in Santa Clara, California.", "ceo": "Lisa T. Su", "sector": "Technology", "country": "US", "fullTimeEmployees": "28000", "phone": "408 749 4000", "address": "2485 Augustine Drive", "city": "Santa Clara", "state": "CA", "zip": "95054", "dcfDiff": 127.08404, "dcf": 52.16096240642768, "image": "https://images.financialmodelingprep.com/symbol/AMD.png", "ipoDate": "1980-03-17", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SOXL", "price": 27.03, "beta": 4.92, "volAvg": 129717059, "mktCap": 14867960647, "lastDiv": 0.26914, "range": "7.23-44.76", "changes": 0.15, "companyName": "Direxion Daily Semiconductor Bull 3X Shares", "currency": "USD", "cik": "0001424958", "isin": "US25459W4583", "cusip": "25459W458", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Asset Management", "website": null, "description": "The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a rules-based, modified float-adjusted market capitalization-weighted index that tracks the performance of the thirty largest U.S. listed semiconductor companies. The fund is non-diversified.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": null, "state": "DE", "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SOXL.png", "ipoDate": "2010-03-11", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SLRX", "price": 0.9996, "beta": 0.443, "volAvg": 2922388, "mktCap": 2126439, "lastDiv": 0, "range": "0.452-7.2", "changes": 0.2585, "companyName": "Salarius Pharmaceuticals, Inc.", "currency": "USD", "cik": "0001615219", "isin": "US79400X4043", "cusip": "79400X404", "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Biotechnology", "website": "https://www.salariuspharma.com", "description": "Salarius Pharmaceuticals, Inc., a clinical-stage biotechnology company, focuses on developing epigenetic-based cancer treatments. Its lead candidate is Seclidemstat (SP-2577), a small molecular inhibitor which is in Phase I/II clinical trial for the treatment of advanced solid tumors, as well as Ewing sarcoma. The company also offers SP-3164, a small molecular protein degrader for the treatment of hematological and solid tumors. It has a strategic partnership with The University of Utah Research Foundation for the exclusive license with respect to patent rights protecting SP-2577 and related compounds; HLB Life Sciences to develop, produce, manufacture, use, and sell the drug in South Korea; and Cancer Prevention and Research Institute of Texas for product development activities, as well as a research partnership with the Cancer Epigenetics Institute at Fox Chase Cancer Center to identify new indications and biomarkers for SP-2577. The company is headquartered in Houston, Texas.", "ceo": "David J. Arthur", "sector": "Healthcare", "country": "US", "fullTimeEmployees": "2", "phone": "832 834 6992", "address": "2450 Holcombe Boulevard", "city": "Houston", "state": "TX", "zip": "77021", "dcfDiff": -1.15056, "dcf": 2.299562465574043, "image": "https://images.financialmodelingprep.com/symbol/SLRX.png", "ipoDate": "2015-01-29", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SQQQ", "price": 18.17, "beta": -3.27, "volAvg": 95649314, "mktCap": 2907547992, "lastDiv": 5.56773, "range": "17.72-57.95", "changes": 0.09, "companyName": "ProShares UltraPro Short QQQ", "currency": "USD", "cik": "0001174610", "isin": "US74347G1922", "cusip": "74347G192", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Asset Management", "website": null, "description": "The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund's investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": null, "state": "DE", "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SQQQ.png", "ipoDate": "2010-02-11", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "TSLA", "price": 321.2, "beta": 2.398, "volAvg": 108395575, "mktCap": 1036014540000, "lastDiv": 0, "range": "182-488.54", "changes": -4.39, "companyName": "Tesla, Inc.", "currency": "USD", "cik": "0001318605", "isin": "US88160R1014", "cusip": "88160R101", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Auto - Manufacturers", "website": "https://www.tesla.com", "description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. It operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.", "ceo": "Elon R. Musk", "sector": "Consumer Cyclical", "country": "US", "fullTimeEmployees": "125665", "phone": "512 516 8177", "address": "1 Tesla Road", "city": "Austin", "state": "TX", "zip": "78725", "dcfDiff": 268.67647, "dcf": 51.93853433936594, "image": "https://images.financialmodelingprep.com/symbol/TSLA.png", "ipoDate": "2010-06-29", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SGD", "price": 1.26, "beta": 3.3417134, "volAvg": 1660944, "mktCap": 2635605, "lastDiv": 0, "range": "0.647-8.41905", "changes": 0.38, "companyName": "Safe and Green Development Corporation", "currency": "USD", "cik": "0001959023", "isin": "US78637J1051", "cusip": "78637J105", "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Real Estate - Development", "website": "https://www.safeandgreenholdings.com/modular-development", "description": "Safe and Green Development Corporation operates as a real estate development company. It focuses on building single or multifamily projects. The company was formerly known as SGB Development Corp. and changed its name to Safe and Green Development Corporation in December 2022. The company was incorporated in 2021 and is based in Miami, Florida. Safe and Green Development Corporation is a subsidiary of Safe & Green Holdings Corp.", "ceo": "David Villarreal Jr.", "sector": "Real Estate", "country": "US", "fullTimeEmployees": "6", "phone": "904-496-0027", "address": "990 Biscayne Blvd", "city": "Miami", "state": "FL", "zip": "33132", "dcfDiff": 1.99077, "dcf": -0.6807661, "image": "https://images.financialmodelingprep.com/symbol/SGD.png", "ipoDate": "2023-09-19", "defaultImage": true, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "IXHL", "price": 1.07, "beta": 2.468, "volAvg": 114460095, "mktCap": 100254046, "lastDiv": 0, "range": "0.08-3.12", "changes": -0.12, "companyName": "Incannex Healthcare Limited", "currency": "USD", "cik": "0001873875", "isin": "US45333F1093", "cusip": "45333L106", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Drug Manufacturers - Specialty & Generic", "website": "https://www.incannex.com.au", "description": "Incannex Healthcare Limited engages in the research, development, and sale of medicinal cannabinoid products in Australia. It offers pharmaceutical grade cannabinoid products under the Incannex brand name. The company's products include IHL-42X, which is in Phase II clinical trials for obstructive sleep apnea; IHL-216A for traumatic brain injury; and IHL-675A, a combination of hydroxychloroquine and cannabidiol for the prevention and treatment of inflammatory lung conditions, such as acute respiratory distress syndrome, chronic obstructive pulmonary disease, asthma, and bronchitis, as well as rheumatoid arthritis and inflammatory bowel diseases. It has partnership with The Alfred Hospital and Novotech on IHL-42X clinical program for obstructive sleep apnea; and Monash Trauma Group at the Department of Neuroscience, Monash University to conduct a study on the protective effect of IHL-216A in sports concussion. The company was formerly known as Impression Healthcare Limited and changed its name to Incannex Healthcare Limited in June 2020. Incannex Healthcare Limited was incorporated in 2001 and is based in Sydney, Australia.", "ceo": "Joel Bradley Latham", "sector": "Healthcare", "country": "AU", "fullTimeEmployees": "9", "phone": "61 4 2570 3805", "address": "207/11 Solent Circuit", "city": "Sydney", "state": "NSW", "zip": "2153", "dcfDiff": 0.79563, "dcf": 0.21937201435264597, "image": "https://images.financialmodelingprep.com/symbol/IXHL.png", "ipoDate": "2022-03-02", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "AAL", "price": 11.42, "beta": 1.359, "volAvg": 60824098, "mktCap": 7535247180, "lastDiv": 0, "range": "8.5-19.1", "changes": -0.16, "companyName": "American Airlines Group Inc.", "currency": "USD", "cik": "0000006201", "isin": "US02376R1023", "cusip": "02376R102", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Airlines, Airports & Air Services", "website": "https://www.aa.com", "description": "American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Madrid, Seattle/Tacoma, Sydney, and Tokyo. As of December 31, 2021, it operated a mainline fleet of 865 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1930 and is headquartered in Fort Worth, Texas.", "ceo": "Robert D. Isom Jr.", "sector": "Industrials", "country": "US", "fullTimeEmployees": "133100", "phone": "682 278 9000", "address": "1 Skyview Drive", "city": "Fort Worth", "state": "TX", "zip": "76155", "dcfDiff": 2.01582, "dcf": 14.4142, "image": "https://images.financialmodelingprep.com/symbol/AAL.png", "ipoDate": "2005-09-27", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "QH", "price": 0.1021, "beta": 0.458, "volAvg": 3646981, "mktCap": 9093572, "lastDiv": 0, "range": "0.0958-2.27", "changes": -0.0159, "companyName": "Quhuo Limited", "currency": "USD", "cik": "0001781193", "isin": "US74841Q2093", "cusip": "74841Q100", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Software - Application", "website": "https://www.quhuo.cn", "description": "Quhuo Limited, through its subsidiaries, operates a workforce operational solution platform in the People's Republic of China. The company provides tech-enabled and end-to-end operational solutions to blue-chip on-demand consumer service businesses in industries with e-commerce exposure, including delivery, ride-hailing, housekeeping, and bike-sharing. It also offers on-demand delivery solutions for industry customers with focus on items, such as grocery, and prepared and fresh food; ride hailing solutions for ride-hailing companies; housekeeping solutions and other services for short-term rental properties and hotel cleaning services; and shared-bike maintenance solutions to address the demand for maintenance and distribution services from bike-sharing companies. In addition, the company develops computer software and applications. Quhuo Limited was founded in 2012 and is based in Beijing, the People's Republic of China.", "ceo": "Leslie Yu", "sector": "Technology", "country": "CN", "fullTimeEmployees": "421", "phone": "86 10 5338 4963", "address": "Tonghui Building", "city": "Beijing", "state": null, "zip": "100020", "dcfDiff": 2.16049, "dcf": -0.7054886906653867, "image": "https://images.financialmodelingprep.com/symbol/QH.png", "ipoDate": "2020-07-10", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": true, "isFund": false}, {"symbol": "SRPT", "price": 15.83, "beta": 0.443, "volAvg": 10431163, "mktCap": 1555724910, "lastDiv": 0, "range": "10.42-145", "changes": 1.97, "companyName": "Sarepta Therapeutics, Inc.", "currency": "USD", "cik": "0000873303", "isin": "US8036071004", "cusip": "803607100", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Biotechnology", "website": "https://www.sarepta.com", "description": "Sarepta Therapeutics, Inc., a commercial-stage biopharmaceutical company, focuses on the discovery and development of RNA-targeted therapeutics, gene therapies, and other genetic therapeutic modalities for the treatment of rare diseases. It offers EXONDYS 51 injection to treat duchenne muscular dystrophy (duchenne) in patients with confirmed mutation of the dystrophin gene that is amenable to exon 51 skipping; and VYONDYS 53 for the treatment of duchenne in patients with confirmed mutation of the dystrophin gene that is amenable to exon 53 skipping. The company is also developing AMONDYS 45, a product candidate that uses phosphorodiamidate morpholino oligomer chemistry and exon-skipping technology to skip exon 45 of the dystrophin gene; SRP-5051, a peptide conjugated PMO that binds exon 51 of dystrophin pre-mRNA; SRP-9001, a DMD micro-dystrophin gene therapy program; and SRP-9003, a limb-girdle muscular dystrophies gene therapy program. It has collaboration agreements with F. Hoffman-La Roche Ltd; Nationwide Children's Hospital; Lysogene; Duke University; Genethon; and StrideBio. The company was incorporated in 1980 and is headquartered in Cambridge, Massachusetts.", "ceo": "Douglas S. Ingram", "sector": "Healthcare", "country": "US", "fullTimeEmployees": "1372", "phone": "617 274 4000", "address": "215 First Street", "city": "Cambridge", "state": "MA", "zip": "02142", "dcfDiff": 14.8018, "dcf": 137.692, "image": "https://images.financialmodelingprep.com/symbol/SRPT.png", "ipoDate": "1997-06-04", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "BBAI", "price": 6.62, "beta": 3.212, "volAvg": 107349206.7, "mktCap": 1927671180, "lastDiv": 0, "range": "1.165-10.36", "changes": -0.53, "companyName": "BigBear.ai Holdings, Inc.", "currency": "USD", "cik": "0001836981", "isin": "US08975B1098", "cusip": "08975B109", "exchange": "New York Stock Exchange", "exchangeShortName": "NYSE", "industry": "Information Technology Services", "website": "https://bigbear.ai", "description": "BigBear.ai Holdings, Inc. provides artificial intelligence and machine learning for decision support. The company operates through two segments, Cyber & Engineering and Analytics. The Cyber & Engineering segment offers high-end technology and management consulting services. It focuses in the areas of cloud engineering and enterprise IT, cybersecurity, computer network operations and wireless, systems engineering, and strategy and program planning. The Analytics segment provides high-end technology and consulting services. This segment focuses on the areas of big data computing and analytical solutions, including predictive and prescriptive analytics solutions. Its solutions assist customers in aggregating, interpreting, and synthesizing data to enable real-time decision-making capabilities. The company is headquartered in Columbia, Maryland.", "ceo": "Kevin McAleenan", "sector": "Technology", "country": "US", "fullTimeEmployees": "630", "phone": "410-312-0885", "address": "6811 Benjamin Franklin Drive", "city": "Columbia", "state": "MD", "zip": "21046", "dcfDiff": 8.35342, "dcf": -1.5947225943656755, "image": "https://images.financialmodelingprep.com/symbol/BBAI.png", "ipoDate": "2021-04-05", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "WBD", "price": 13.12, "beta": 1.544, "volAvg": 58525027, "mktCap": 32459929600, "lastDiv": 0, "range": "6.64-13.87", "changes": -0.58, "companyName": "Warner Bros. Discovery, Inc.", "currency": "USD", "cik": "0001437107", "isin": "US9344231041", "cusip": "934423104", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Entertainment", "website": "https://ir.wbd.com", "description": "Warner Bros. Discovery, Inc. operates as a media and entertainment company worldwide. It operates through three segments: Studios, Network, and DTC. The Studios segment produces and releases feature films for initial exhibition in theaters; produces and licenses television programs to its networks and third parties and direct-to-consumer services; distributes films and television programs to various third parties and internal television; and offers streaming services and distribution through the home entertainment market, themed experience licensing, and interactive gaming. The Network segment comprises domestic and international television networks. The DTC segment offers premium pay-tv and streaming services. In addition, the company offers portfolio of content, brands, and franchises across television, film, streaming, and gaming under the Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, Discovery Channel, discovery+, CNN, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Batman, Superman, Wonder Woman, Harry Potter, Looney Tunes, Hanna-Barbera, Game of Thrones, and The Lord of the Rings brands. Further, it provides content through distribution platforms, including linear network, free-to-air, and broadcast television; authenticated GO applications, digital distribution arrangements, content licensing arrangements, and direct-to-consumer subscription products. Warner Bros. Discovery, Inc. was incorporated in 2008 and is headquartered in New York, New York.", "ceo": "David M. Zaslav", "sector": "Communication Services", "country": "US", "fullTimeEmployees": "35000", "phone": "212 548 5555", "address": "230 Park Avenue South", "city": "New York City", "state": "NY", "zip": "10003", "dcfDiff": -10.49619, "dcf": 20.951193028344367, "image": "https://images.financialmodelingprep.com/symbol/WBD.png", "ipoDate": "2005-07-08", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "PLUG", "price": 1.59, "beta": 2.296, "volAvg": 117419411, "mktCap": 1824270600, "lastDiv": 0, "range": "0.69-3.32", "changes": -0.18, "companyName": "Plug Power Inc.", "currency": "USD", "cik": "0001093691", "isin": "US72919P2020", "cusip": "72919P202", "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Electrical Equipment & Parts", "website": "https://www.plugpower.com", "description": "Plug Power Inc. delivers end-to-end clean hydrogen and zero-emissions fuel cell solutions for supply chain and logistics applications, on-road electric vehicles, stationary power market, and others in North America and internationally. It engages in building an end-to-end green hydrogen ecosystem, including green hydrogen production, storage and delivery, and energy generation through mobile or stationary applications. The company provides proton exchange membrane (PEM), fuel cell and fuel processing technologies, and fuel cell/battery hybrid technologies, as well as related hydrogen and green hydrogen generation, storage, and dispensing infrastructure. The company offers GenDrive, a hydrogen-fueled PEM fuel cell system that provides power to material handling electric vehicles; GenFuel, a liquid hydrogen fueling delivery, generation, storage, and dispensing system; GenCare, an ongoing Internet of Things-based maintenance and on-site service program for GenDrive fuel cell systems, GenSure fuel cell systems, GenFuel hydrogen storage and dispensing products, and ProGen fuel cell engines; and GenSure, a stationary fuel cell solution that offers modular PEM fuel cell power to support the backup and grid-support power requirements of the telecommunications, transportation, and utility sectors. It also provides GenKey, an integrated turn-key solution for transitioning to fuel cell power; ProGen, a fuel cell stack and engine technology used in mobility and stationary fuel cell systems, and as engines in electric delivery vans; and GenFuel Electrolyzers that are hydrogen generators optimized for clean hydrogen production. The company sells its products through a direct product sales force, original equipment manufacturers, and dealer networks. It has strategic agreements with Airbus; Lhyfe; Edison Motors; Phillips 66; Apex Clean Energy; BAE Systems; and Universal Hydrogen Co. The company was founded in 1997 and is headquartered in Latham, New York.", "ceo": "Andrew J. Marsh", "sector": "Industrials", "country": "US", "fullTimeEmployees": "3224", "phone": "518 782 7700", "address": "968 Albany Shaker Road", "city": "Latham", "state": "NY", "zip": "12110", "dcfDiff": 3.77527, "dcf": 19.6353, "image": "https://images.financialmodelingprep.com/symbol/PLUG.png", "ipoDate": "1999-10-29", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "HWH", "price": 1.96, "beta": -0.662, "volAvg": 1978257, "mktCap": 12693744, "lastDiv": 0, "range": "0.9-7.2", "changes": 0.52, "companyName": "HWH International Inc.", "currency": "USD", "cik": "0001897245", "isin": "US44852G3092", "cusip": "44852G101", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Leisure", "website": "https://www.hwhintl.com", "description": "HWH International Inc. operates a marketplace platform to provide products and services for health, wealth, and happiness. It operates HWH Marketplace, a marketing place; Hapi Café; Hapi Travel Destination platform to book travel, hotel, and vacation packages; and Hapi Wealth builder program. The company is based in Bethesda, Maryland. HWH International Inc operates as a subsidiary of Alset International Limited", "ceo": "John Thatch", "sector": "Consumer Cyclical", "country": "US", "fullTimeEmployees": "16", "phone": "301-971-3955", "address": "4800 Montgomery Lane", "city": "Bethesda", "state": "MD", "zip": "20814", "dcfDiff": 2.77551, "dcf": -0.8856067858734737, "image": "https://images.financialmodelingprep.com/symbol/HWH.png", "ipoDate": "2022-03-24", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SPY", "price": 635.26, "beta": 1, "volAvg": 68747331, "mktCap": 583030202214, "lastDiv": 7.16773, "range": "481.8-638.67", "changes": -1.68, "companyName": "SPDR S&P 500 ETF Trust", "currency": "USD", "cik": "0000884394", "isin": "US78462F1030", "cusip": "78462F103", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Asset Management", "website": "http://www.spdrs.com", "description": "The Trust seeks to achieve its investment objective by holding a portfolio of the common stocks that are included in the index (the “Portfolio”), with the weight of each stock in the Portfolio substantially corresponding to the weight of such stock in the index.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": "New York City", "state": "NY", "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SPY.png", "ipoDate": "1993-01-29", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "TQQQ", "price": 89.38, "beta": 3.46, "volAvg": 70227434, "mktCap": 26984059840, "lastDiv": 0.92167, "range": "35-93.79", "changes": -0.405, "companyName": "ProShares UltraPro QQQ", "currency": "USD", "cik": "0001174610", "isin": "US74347X8314", "cusip": "74347X831", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Asset Management", "website": null, "description": "The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund's investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": null, "state": "DE", "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/TQQQ.png", "ipoDate": "2010-02-11", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SMCI", "price": 58.63, "beta": 1.425, "volAvg": 44987544, "mktCap": 34991439340, "lastDiv": 0, "range": "17.25-72.445", "changes": -1.42, "companyName": "Super Micro Computer, Inc.", "currency": "USD", "cik": "0001375365", "isin": "US86800U3023", "cusip": "86800U302", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Computer Hardware", "website": "https://www.supermicro.com", "description": "Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.", "ceo": "Charles Liang", "sector": "Technology", "country": "US", "fullTimeEmployees": "5684", "phone": "408 503 8000", "address": "980 Rock Avenue", "city": "San Jose", "state": "CA", "zip": "95131", "dcfDiff": 557.80358, "dcf": 54.968317310674884, "image": "https://images.financialmodelingprep.com/symbol/SMCI.png", "ipoDate": "2007-03-29", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SCNI", "price": 2, "beta": 2.041, "volAvg": 1335234, "mktCap": 1705990, "lastDiv": 0, "range": "1.86-6.18", "changes": -0.045, "companyName": "Scinai Immunotherapeutics Ltd.", "currency": "USD", "cik": "0001611747", "isin": "US09073Q2049", "cusip": "09073Q204", "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Biotechnology", "website": "https://www.scinai.com", "description": "Scinai Immunotherapeutics Ltd., a development stage biopharmaceutical company, focuses on developing, manufacturing, and commercializing products for the prevention and treatment of infectious and autoimmune diseases, and other illnesses in Israel. It has licensing and collaboration agreement with Max Planck Society and University Medical Center Göttingen for the development and commercialization of COVID-19 nanosized antibody (NanoAb); and development and commercialization of NanoAbs for various other disease indications. The company was formerly known as BiondVax Pharmaceuticals Ltd. and changed its name to Scinai Immunotherapeutics Ltd. in September 2023. Scinai Immunotherapeutics Ltd. was incorporated in 2003 and is headquartered in Jerusalem, Israel.", "ceo": "Amir Reichman", "sector": "Healthcare", "country": "IL", "fullTimeEmployees": "31", "phone": "972 8 930 2529", "address": "Jerusalem BioPark Building", "city": "Jerusalem", "state": null, "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SCNI.png", "ipoDate": "2015-05-11", "defaultImage": true, "isEtf": false, "isActivelyTrading": true, "isAdr": true, "isFund": false}, {"symbol": "F", "price": 11.08, "beta": 1.501, "volAvg": 90507029, "mktCap": 43275156000, "lastDiv": 0.75, "range": "8.44-11.97", "changes": -0.2, "companyName": "Ford Motor Company", "currency": "USD", "cik": "0000037996", "isin": "US3453708600", "cusip": "345370860", "exchange": "New York Stock Exchange", "exchangeShortName": "NYSE", "industry": "Auto - Manufacturers", "website": "https://www.ford.com", "description": "Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.", "ceo": "James Duncan Farley Jr.", "sector": "Consumer Cyclical", "country": "US", "fullTimeEmployees": "170000", "phone": "313 322 3000", "address": "One American Road", "city": "Dearborn", "state": "MI", "zip": "48126-1899", "dcfDiff": -20.04877, "dcf": 31.173769783718488, "image": "https://images.financialmodelingprep.com/symbol/F.png", "ipoDate": "1972-06-01", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SPXS", "price": 4.37, "beta": -2.9, "volAvg": 58364783, "mktCap": 415044054, "lastDiv": 0.25234, "range": "4.3-10.67", "changes": 0.03, "companyName": "Direxion Daily S&P 500 Bear 3X Shares", "currency": "USD", "cik": "0001424958", "isin": "US25460E2651", "cusip": "25460E265", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Asset Management - Leveraged", "website": "https://www.direxion.com/product/daily-sp-500-bull-bear-3x-etfs", "description": "The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund's net assets (plus borrowing for investment purposes). The index is a float-adjusted, market capitalization-weighted index. The fund is non-diversified.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": "1301 Avenue of the Americas", "city": "New York City", "state": "DE", "zip": "10019", "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SPXS.png", "ipoDate": "2008-11-19", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "DRRX", "price": 1.88, "beta": 0.647, "volAvg": 933678, "mktCap": 58360088, "lastDiv": 0, "range": "0.48-2.64", "changes": 1.3273, "companyName": "DURECT Corporation", "currency": "USD", "cik": "0001082038", "isin": "US2666055007", "cusip": "266605104", "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Drug Manufacturers - Specialty & Generic", "website": "https://www.durect.com", "description": "DURECT Corporation, a biopharmaceutical company, researches and develops medicines based on its epigenetic regulator and pharmaceutical programs. The company offers ALZET product line that consists of osmotic pumps and accessories used for research in mice, rats, and other laboratory animals. It also develops larsucosterol (DUR-928), an endogenous, orally bioavailable small molecule that is in Phase IIb clinical trial to play a regulatory role in lipid metabolism, stress and inflammatory responses, and cell death and survival to treat alcohol-associated hepatitis, as well as completed Phase Ib clinical trial to treat patients with nonalcoholic steatohepatitis. In addition, the company offers POSIMIR, a post-surgical pain product to deliver bupivacaine up to days of in adults; and Methydur to treat attention deficit hyperactivity disorder. It markets and sells its ALZET lines through direct sales force in the United States, as well as through a network of distributors in Japan, Europe, and internationally. The company has strategic collaboration and other agreements with Virginia Commonwealth University Intellectual Property Foundation; Indivior UK Ltd.; and Santen Pharmaceutical Co., Ltd. DURECT Corporation was incorporated in 1998 and is headquartered in Cupertino, California.", "ceo": "James E. Brown D.V.M.", "sector": "Healthcare", "country": "US", "fullTimeEmployees": "21", "phone": "408 777 1417", "address": "10260 Bubb Road", "city": "Cupertino", "state": "CA", "zip": "95014-4166", "dcfDiff": 1.80338, "dcf": 0.09652026910045797, "image": "https://images.financialmodelingprep.com/symbol/DRRX.png", "ipoDate": "2000-09-28", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "ADAP", "price": 0.1049, "beta": 2.186, "volAvg": 4033560, "mktCap": 27048357, "lastDiv": 0, "range": "0.098-1.365", "changes": 0.0049, "companyName": "Adaptimmune Therapeutics plc", "currency": "USD", "cik": "0001621227", "isin": "US00653A1079", "cusip": "00653A107", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Biotechnology", "website": "https://www.adaptimmune.com", "description": "Adaptimmune Therapeutics plc, a clinical-stage biopharmaceutical company, focuses on providing novel cell therapies primarily to patients with solid tumors in the United States and the United Kingdom. The company's specific peptide enhanced affinity receptor (SPEAR) T-cell platform enables it to identify cancer targets. It is developing ADP-A2M4 that is in phase II clinical trials with SPEARHEAD-1 for synovial sarcoma and myxoid round cell liposarcoma indications (MRCLS); in phase II clinical trials with SPEARHEAD-2 for patients with head and neck cancer; and in phase I clinical trials for urothelial, melanoma, head and neck, ovarian, non-small cell lung, esophageal and gastric, synovial sarcoma, and MRCLS cancers. The company is also developing ADP-A2AFP, which is in phase I clinical trials for hepatocellular carcinoma; and ADP-A2M4CD8, which is in phase I clinical trial for SPEAR T-cells focusing on treating patients with lung, gastroesophageal, head and neck, ovarian, and bladder cancers. It has a collaboration and license agreement with GSK; third party collaborations with Noile-Immune Biotech Inc., Alpine Immune Sciences, Inc., and National Center for Cancer Immune Therapy in Denmark; strategic alliance agreement with the MD Anderson Cancer Center; and co-development and co-commercialization agreement with Universal Cells, Inc. Adaptimmune Therapeutics plc also has a strategic collaboration and license agreement with Genentech, Inc. and F. Hoffman-La Roche Ltd to develop personalized allogeneic T-cell therapies utilizing aß T-cell receptors. Adaptimmune Therapeutics plc was founded in 2008 and is headquartered in Abingdon, the United Kingdom.", "ceo": "Adrian G. Rawcliffe", "sector": "Healthcare", "country": "GB", "fullTimeEmployees": "506", "phone": "44 12 3543 0000", "address": "60 Jubilee Avenue", "city": "Abingdon", "state": null, "zip": "OX14 4RX", "dcfDiff": 1.75027, "dcf": -0.0002702050991380804, "image": "https://images.financialmodelingprep.com/symbol/ADAP.png", "ipoDate": "2015-05-06", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": true, "isFund": false}, {"symbol": "AAPL", "price": 211.27, "beta": 1.199, "volAvg": 53252362, "mktCap": 3155486466000, "lastDiv": 1.01, "range": "169.21-260.1", "changes": -2.78, "companyName": "Apple Inc.", "currency": "USD", "cik": "0000320193", "isin": "US0378331005", "cusip": "037833100", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Consumer Electronics", "website": "https://www.apple.com", "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.", "ceo": "Timothy D. Cook", "sector": "Technology", "country": "US", "fullTimeEmployees": "164000", "phone": "(408) 996-1010", "address": "One Apple Park Way", "city": "Cupertino", "state": "CA", "zip": "95014", "dcfDiff": 47.73634, "dcf": 164.24365929273992, "image": "https://images.financialmodelingprep.com/symbol/AAPL.png", "ipoDate": "1980-12-12", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "BMNR", "price": 32, "beta": 1.388, "volAvg": 19211440, "mktCap": 3593952000, "lastDiv": 0, "range": "3.92-161", "changes": -3.11, "companyName": "Bitmine Immersion Technologies, Inc.", "currency": "USD", "cik": "0001829311", "isin": "US09175A1079", "cusip": "09175A107", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Financial - Capital Markets", "website": "https://bitminetech.io", "description": "Bitmine Immersion Technologies, Inc. operates as a blockchain technology company primarily in the United States. The company engages in hosting third-party equipment used in mining of digital asset coins and tokens, primarily Bitcoin, as well as the self-mining for its own account. It also sells mining equipment to customers and related parties. In addition, the company offers data centers, which provides power, racks, proprietary thermodynamic management, redundant connectivity, and security services, as well as software, which provides infrastructure management and custom firmware. The company was formerly known as Sandy Springs Holdings Inc. Bitmine Immersion Technologies, Inc. was incorporated in 2019 and is based in Las Vegas, Nevada.", "ceo": "Jonathan Robert Bates", "sector": "Financial Services", "country": "US", "fullTimeEmployees": "7", "phone": "404 816 8240", "address": "10845 Griffith Peak Drive", "city": "Las Vegas", "state": "NV", "zip": "89135", "dcfDiff": 57.47774, "dcf": -24.35634252110194, "image": "https://images.financialmodelingprep.com/symbol/BMNR.png", "ipoDate": "1997-12-17", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "JBLU", "price": 4.65, "beta": 1.759, "volAvg": 23223145, "mktCap": 1647681000, "lastDiv": 0, "range": "3.34-8.31", "changes": 0.29, "companyName": "JetBlue Airways Corporation", "currency": "USD", "cik": "0001158463", "isin": "US4771431016", "cusip": "477143101", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Airlines, Airports & Air Services", "website": "https://www.jetblue.com", "description": "JetBlue Airways Corporation provides air passenger transportation services. As of December 31, 2021, the company operated a fleet of 63 Airbus A321 aircraft, 8 Airbus A220 aircraft, 21 Airbus A321neo aircraft, 130 Airbus A320 aircraft, and 60 Embraer E190 aircraft. It also served 107 destinations in the 31 states in the United States, the District of Columbia, the Commonwealth of Puerto Rico, the U.S. Virgin Islands, and 24 countries in the Caribbean and Latin America. JetBlue Airways Corporation has a strategic partnership with American Airlines Group Inc. to create connectivity for travelers in the Northeast. The company was incorporated in 1998 and is based in Long Island City, New York.", "ceo": "Joanna L. Geraghty", "sector": "Industrials", "country": "US", "fullTimeEmployees": "23000", "phone": "718 286 7900", "address": "27-01 Queens Plaza North", "city": "Long Island City", "state": "NY", "zip": "11101", "dcfDiff": 6.08414, "dcf": 14.0541, "image": "https://images.financialmodelingprep.com/symbol/JBLU.png", "ipoDate": "2002-04-12", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SOAR", "price": 1.78, "beta": 0.823, "volAvg": 2516945, "mktCap": 3698699, "lastDiv": 0, "range": "1.14-19.05", "changes": 0.07, "companyName": "Volato Group, Inc.", "currency": "USD", "cik": "0001853070", "isin": "US74349W3025", "cusip": null, "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Airlines, Airports & Air Services", "website": "https://flyvolato.com", "description": "Volato Group, Inc. operates as a private aviation company. The company offers fractional ownership, aircraft management, jet cards, deposit, and charter programs. As of December 31, 2023, it operated a fleet of 24 HondaJets and a managed fleet of 6 aircraft. The company was founded in 2021 and is based in Chamblee, Georgia.", "ceo": "Matthew Dennis Liotta", "sector": "Industrials", "country": "US", "fullTimeEmployees": "12", "phone": "844 399 8998", "address": "1954 Airport Road", "city": "Chamblee", "state": "GA", "zip": "30341", "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/SOAR.png", "ipoDate": "2022-01-21", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "TLT", "price": 87.32, "beta": 2.19, "volAvg": 38018470, "mktCap": 48263424041, "lastDiv": 3.83311, "range": "83.3-101.64", "changes": 1.45, "companyName": "iShares 20+ Year Treasury Bond ETF", "currency": "USD", "cik": "0001100663", "isin": "US4642874329", "cusip": "464287432", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Asset Management - Bonds", "website": null, "description": "The fund will invest at least 80% of its assets in the component securities of the underlying index, and it will invest at least 90% of its assets in U.S. Treasury securities that the advisor believes will help the fund track the underlying index. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity greater than or equal to twenty years.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": "San Francisco", "state": "DE", "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/TLT.png", "ipoDate": "2002-07-30", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "AMDL", "price": 13.03, "beta": 3.6674533, "volAvg": 37803081, "mktCap": 479428478, "lastDiv": 0, "range": "2.77-17", "changes": 0.53, "companyName": "GraniteShares 2x Long AMD Daily ETF", "currency": "USD", "cik": null, "isin": "US38747R7513", "cusip": "38747R751", "exchange": "NASDAQ", "exchangeShortName": "NASDAQ", "industry": "Asset Management", "website": null, "description": "The fund is an actively managed exchange traded fund that attempts to replicate 2 times (200%) the daily percentage change of the underlying stock by entering into a swap agreement on the underlying stock. It aims to generate 2 times the daily performance of the underlying stock for a single day. The fund is non-diversified.", "ceo": null, "sector": "", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": null, "state": null, "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/AMDL.png", "ipoDate": "", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "DNN", "price": 2.13, "beta": 1.945, "volAvg": 114662522, "mktCap": 1909214850, "lastDiv": 0, "range": "1.08-2.47", "changes": -0.09, "companyName": "Denison Mines Corp.", "currency": "USD", "cik": "0001063259", "isin": "CA2483561072", "cusip": "248356107", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Uranium", "website": "https://www.denisonmines.com", "description": "Denison Mines Corp. engages in the acquisition, exploration, development, extraction, processing, selling of, and investing in uranium properties in Canada. Its flagship project is the 95% interest owned Wheeler River uranium project located in the Athabasca Basin region in northern Saskatchewan. The company was formerly known as International Uranium Corporation and changed its name to Denison Mines Corp. in December 2006. Denison Mines Corp. was founded in 1997 and is headquartered in Toronto, Canada.", "ceo": "David Daniel Cates MAcc", "sector": "Energy", "country": "CA", "fullTimeEmployees": "65", "phone": "14169791991", "address": "40 University Avenue", "city": "Toronto", "state": "ON", "zip": "M5J 1T1", "dcfDiff": 2.13405, "dcf": 0.03095291508408489, "image": "https://images.financialmodelingprep.com/symbol/DNN.png", "ipoDate": "2005-02-09", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "FUBO", "price": 3.54, "beta": 2.239, "volAvg": 15697596, "mktCap": 1209051600, "lastDiv": 0, "range": "1.15-6.45", "changes": 0.01, "companyName": "fuboTV Inc.", "currency": "USD", "cik": "0001484769", "isin": "US35953D1046", "cusip": "35953D104", "exchange": "New York Stock Exchange", "exchangeShortName": "NYSE", "industry": "Broadcasting", "website": "https://www.fubo.tv", "description": "fuboTV Inc. operates a live TV streaming platform for live sports, news, and entertainment content in the United States and internationally. Its fuboTV platform allows customers to access content through streaming devices, as well as on SmartTVs, computers, mobile phones, and tablets. The company is headquartered in New York, New York.", "ceo": "David Gandler", "sector": "Communication Services", "country": "US", "fullTimeEmployees": "590", "phone": "212 672 0055", "address": "1290 Avenue of the Americas", "city": "New York City", "state": "NY", "zip": "10104", "dcfDiff": 1.90345, "dcf": -0.16344996793312075, "image": "https://images.financialmodelingprep.com/symbol/FUBO.png", "ipoDate": "2019-03-27", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "GIBO", "price": 0.095, "beta": 0, "volAvg": 92803845, "mktCap": 50388474, "lastDiv": 0, "range": "0.029-24.18", "changes": 0.0278, "companyName": "GIBO Holdings Limited", "currency": "USD", "cik": "0002034520", "isin": "KYG386171097", "cusip": null, "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Internet Content & Information", "website": "https://globalibo.com", "description": "GIBO Holdings Limited operates as an AI-driven animation streaming company. It provides AIGC animation streaming platform with extensive functionalities provided to both viewers and creators that serves to young people community. The company is based in Kwai Chung, Hong Kong.", "ceo": null, "sector": "Communication Services", "country": "HK", "fullTimeEmployees": null, "phone": null, "address": "Unit 2912, Metroplaza", "city": "Kwai Chung", "state": null, "zip": null, "dcfDiff": -0.53639, "dcf": 0.8263880164566045, "image": "https://images.financialmodelingprep.com/symbol/GIBO.png", "ipoDate": "2023-09-05", "defaultImage": true, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "INTC", "price": 20.41, "beta": 1.145, "volAvg": 80906926, "mktCap": 89334570000, "lastDiv": 0.125, "range": "17.67-30.87", "changes": -0.27, "companyName": "Intel Corporation", "currency": "USD", "cik": "0000050863", "isin": "US4581401001", "cusip": "458140100", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Semiconductors", "website": "https://www.intel.com", "description": "Intel Corporation engages in the design, manufacture, and sale of computer products and technologies worldwide. The company operates through CCG, DCG, IOTG, Mobileye, NSG, PSG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products, including accelerators, boards and systems, connectivity products, graphics, and memory and storage products. The company also provides high-performance compute solutions for targeted verticals and embedded applications for retail, industrial, and healthcare markets; and solutions for assisted and autonomous driving comprising compute platforms, computer vision and machine learning-based sensing, mapping and localization, driving policy, and active sensors. In addition, it offers workload-optimized platforms and related products for cloud service providers, enterprise and government, and communications service providers. The company serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was incorporated in 1968 and is headquartered in Santa Clara, California.", "ceo": "Lip-Bu Tan", "sector": "Technology", "country": "US", "fullTimeEmployees": "108900", "phone": "408 765 8080", "address": "2200 Mission College Boulevard", "city": "Santa Clara", "state": "CA", "zip": "95054-1549", "dcfDiff": 46.4885, "dcf": -22.99850241923004, "image": "https://images.financialmodelingprep.com/symbol/INTC.png", "ipoDate": "1980-03-17", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "LCID", "price": 2.56, "beta": 0.789, "volAvg": 153301967, "mktCap": 7808665600, "lastDiv": 0, "range": "1.93-4.43", "changes": -0.23, "companyName": "Lucid Group, Inc.", "currency": "USD", "cik": "0001811210", "isin": "US5494981039", "cusip": "549498103", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Auto - Manufacturers", "website": "https://www.lucidmotors.com", "description": "Lucid Group, Inc. a technology and automotive company, develops electric vehicle (EV) technologies. The company designs, engineers, and builds electric vehicles, EV powertrains, and battery systems. As of December 31, 2021, it operates twenty retail studios in the United States. Lucid Group, Inc. was founded in 2007 and is headquartered in Newark, California.", "ceo": "Marc Winterhoff", "sector": "Consumer Cyclical", "country": "US", "fullTimeEmployees": "6800", "phone": "510 648 3553", "address": "7373 Gateway Boulevard", "city": "Newark", "state": "CA", "zip": "94560", "dcfDiff": 2.50556, "dcf": -0.19555643217301458, "image": "https://images.financialmodelingprep.com/symbol/LCID.png", "ipoDate": "2020-09-18", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "NCNA", "price": 0.0503, "beta": 1.437, "volAvg": 243662804, "mktCap": 305426, "lastDiv": 0, "range": "0.033-10.79", "changes": -0.0047, "companyName": "NuCana plc", "currency": "USD", "cik": "0001709626", "isin": "US67022C2052", "cusip": "67022C106", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Biotechnology", "website": "https://www.nucana.com", "description": "NuCana plc, a clinical-stage biopharmaceutical company, engages in the development of products for the treatment of cancer. The company develops its products based on its proprietary ProTide technology. Its lead product candidate includes Acelarin, which is in Phase I clinical trial for patients with advanced solid tumors; Phase Ib for patients with recurrent ovarian cancer; Phase Ib clinical trials for the treatment of patients with biliary tract cancer; Phase II clinical trial for the treatment of patients with platinum-resistant ovarian cancer; and Phase III clinical trial for the treatment of patients with pancreatic cancer. The company is also developing NUC-3373, a ProTide transformation of the active anti-cancer metabolite of 5-fluorouracil, which is in Phase I clinical trial for the treatment of patients with advanced solid tumors and in a Phase 1b/2 clinical trial for patients with advanced colorectal cancer; and NUC-7738, a nucleoside analog that is in Phase 1/2 clinical trial for the treatment of patients with advanced solid tumors and hematological tumors. It has a research, collaboration, and license agreement with Cardiff University and University College Cardiff Consultants Ltd. for the design, synthesis, characterization, and evaluation of ProTides; and an assignment, license, and collaboration agreement with Cardiff ProTides Ltd. The company was formerly known as NuCana BioMed Limited and changed its name to NuCana plc in August 2017. NuCana plc was incorporated in 1997 and is headquartered in Edinburgh, the United Kingdom.", "ceo": "Hugh Stephen Griffith", "sector": "Healthcare", "country": "GB", "fullTimeEmployees": "20", "phone": "44 13 1357 1111", "address": "3 Lochside Way", "city": "Edinburgh", "state": null, "zip": "EH12 9DT", "dcfDiff": -6.85666, "dcf": 10.541661235269219, "image": "https://images.financialmodelingprep.com/symbol/NCNA.png", "ipoDate": "2017-09-28", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": true, "isFund": false}, {"symbol": "OPEN", "price": 2.05, "beta": 2.681, "volAvg": 174261959, "mktCap": 1494712400, "lastDiv": 0, "range": "0.508-4.97", "changes": -0.29, "companyName": "Opendoor Technologies Inc.", "currency": "USD", "cik": "0001801169", "isin": "US6837121036", "cusip": "683712103", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Real Estate - Services", "website": "https://www.opendoor.com", "description": "Opendoor Technologies Inc. operates a digital platform for residential real estate in the United States. The company's platform enables consumers to buy and sell a home online. It also provides title insurance and escrow services. Opendoor Technologies Inc. was incorporated in 2013 and is based in Tempe, Arizona.", "ceo": "Carrie A. Wheeler", "sector": "Real Estate", "country": "US", "fullTimeEmployees": "1470", "phone": "415 896 6737", "address": "410 N Scottsdale Rd", "city": "Tempe", "state": "AZ", "zip": "85281", "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/OPEN.png", "ipoDate": "2020-06-18", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "QS", "price": 9.28, "beta": 4.42, "volAvg": 38908786, "mktCap": 5254154595, "lastDiv": 0, "range": "3.4-15.03", "changes": -1.695, "companyName": "QuantumScape Corporation", "currency": "USD", "cik": "0001811414", "isin": "US74767V1098", "cusip": "74767V109", "exchange": "New York Stock Exchange", "exchangeShortName": "NYSE", "industry": "Auto - Parts", "website": "https://www.quantumscape.com", "description": "QuantumScape Corporation, a development stage company, focuses on the development and commercialization of solid-state lithium-metal batteries for electric vehicles and other applications. The company was founded in 2010 and is headquartered in San Jose, California.", "ceo": "Siva Sivaram", "sector": "Consumer Cyclical", "country": "US", "fullTimeEmployees": "800", "phone": "408 452 2000", "address": "1730 Technology Drive", "city": "San Jose", "state": "CA", "zip": "95110", "dcfDiff": 9.33185, "dcf": 0.09314861976532271, "image": "https://images.financialmodelingprep.com/symbol/QS.png", "ipoDate": "2020-08-17", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "SISI", "price": 0.2185, "beta": -0.917, "volAvg": 6019167, "mktCap": 9839208, "lastDiv": 0, "range": "0.147-17.04", "changes": 0.0647, "companyName": "Shineco, Inc.", "currency": "USD", "cik": "0001300734", "isin": "US8245674085", "cusip": "824567309", "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Drug Manufacturers - Specialty & Generic", "website": "https://www.biosisi.com", "description": "Shineco, Inc. engages in processing and distributing specialized fabrics, textiles, and other byproducts derived from an indigenous Chinese plant Apocynum Venetum in the People's Republic of China. The company's specialized fabrics, textiles, and other byproducts are specialized textile and health supplement products to incorporate traditional Eastern medicines with various scientific methods. It also grows and cultivates yew trees, fast-growing bamboo willows, and scenic greening trees; and provides logistic services for agricultural products. The company is headquartered in Beijing, the People's Republic of China.", "ceo": "Jennifer Zhan", "sector": "Healthcare", "country": "CN", "fullTimeEmployees": "119", "phone": "86 10 5924 6103", "address": "North Tower, Zhengda Center", "city": "Beijing", "state": null, "zip": "100020", "dcfDiff": 1.82124, "dcf": -0.8812410063305611, "image": "https://images.financialmodelingprep.com/symbol/SISI.png", "ipoDate": "2016-09-28", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "TLRY", "price": 0.5769, "beta": 1.904, "volAvg": 32758757, "mktCap": 598891427, "lastDiv": 0, "range": "0.35-2.11", "changes": -0.1228, "companyName": "Tilray Brands, Inc.", "currency": "USD", "cik": "0001731348", "isin": "US88688T1007", "cusip": "88688T100", "exchange": "NASDAQ Global Select", "exchangeShortName": "NASDAQ", "industry": "Drug Manufacturers - Specialty & Generic", "website": "https://www.tilray.com", "description": "Tilray Brands, Inc. engages in the research, cultivation, production, marketing, and distribution of medical cannabis products in Canada, the United States, Europe, Australia, New Zealand, Latin America, and internationally. The company operates through four segments: Cannabis Business, Distribution Business, Beverage Alcohol Business, and Wellness Business. It offers medical and adult-use cannabis products, including GMP-certified flowers, oils, vapes, edibles, and topicals; purchases and resells pharmaceutical and wellness products; and produces, markets, sells, and distributes beverage alcohol products, and hemp-based food and other wellness products. The company offers its products under the Tilray, Aphria, Broken Coast, Symbios, B!NGO, The Batch, P'tite Pof, Dubon, Good Supply, Solei, Chowie Wowie, Canaca, RIFF, SweetWater, Breckenridge Distillery, Alpine Beer Company, and Green Flash brands. It sells its products to retailers, wholesalers, patients, physicians, hospitals, pharmacies, researchers, and governments, as well as direct to consumers. The company was formerly known as Tilray, Inc. Tilray Brands, Inc. is headquartered in Leamington, Canada.", "ceo": "Irwin David Simon", "sector": "Healthcare", "country": "CA", "fullTimeEmployees": "2650", "phone": "12064329325", "address": "265 Talbot Street West", "city": "Leamington", "state": "ON", "zip": "N8H 5L4", "dcfDiff": 1.62413, "dcf": 4.83413, "image": "https://images.financialmodelingprep.com/symbol/TLRY.png", "ipoDate": "2018-07-19", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "TNFA", "price": 0.1544, "beta": 2.326, "volAvg": 25963018, "mktCap": 2190025, "lastDiv": 0, "range": "0.085-2.16", "changes": 0.0294, "companyName": "TNF Pharmaceuticals, Inc.", "currency": "USD", "cik": "0001321834", "isin": "US62856X2018", "cusip": "62856X201", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Biotechnology", "website": "https://tnfpharma.com", "description": "TNF Pharmaceuticals, Inc. operates as a clinical stage pharmaceutical company. It focuses on developing two novel therapeutic platforms that treat the causes of disease rather than addressing the symptoms. Its MYMD-1 is a drug platform based on a clinical stage small molecule that regulates the immune system to control TNF-a, which drives chronic inflammation, and other pro-inflammatory cell signaling cytokines. The MYMD-1 is being developed to delay aging, increase longevity, and treat autoimmune diseases. The company's second drug platform, Supera-CBD, is being developed to treat chronic pain, addiction, and epilepsy. The Supera-CBD is a novel synthetic derivative of cannabidiol (CBD) and is being developed to address and improve the growing CBD market, which includes FDA approved drugs and CBD products not regulated as drugs. TNF Pharmaceuticals, Inc. was formerly known as MyMD Pharmaceuticals, Inc. and changed its name to TNF Pharmaceuticals, Inc. in July 2024. The company was founded in 2014 and is headquartered in Baltimore, Maryland.", "ceo": "Mitchell Glass", "sector": "Healthcare", "country": "US", "fullTimeEmployees": "2", "phone": "856 848 8698", "address": "855 N. Wolfe Street", "city": "New York City", "state": "MD", "zip": "21205", "dcfDiff": 0.06808888, "dcf": 0.06671112022979073, "image": "https://images.financialmodelingprep.com/symbol/TNFA.png", "ipoDate": "", "defaultImage": true, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "TSLL", "price": 11.64, "beta": 2.6695867, "volAvg": 194291552, "mktCap": 6287278663, "lastDiv": 0.39424, "range": "6.29-41.5", "changes": -0.31, "companyName": "Direxion Daily TSLA Bull 2X Shares", "currency": "USD", "cik": null, "isin": "US25460G2865", "cusip": "25460G286", "exchange": "NASDAQ Global Market", "exchangeShortName": "NASDAQ", "industry": "Asset Management", "website": null, "description": "The fund, under normal circumstances, invests at least 80% of its net assets (plus any borrowings for investment purposes) in the securities of TSLA and financial instruments, such as swap agreements and options, that provide leveraged exposure to TSLA. The fund is non-diversified.", "ceo": "", "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": null, "state": null, "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/TSLL.png", "ipoDate": "2022-08-09", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "ULTY", "price": 6.19, "beta": 1.7936442, "volAvg": 15736783, "mktCap": 665273914, "lastDiv": 7.6229, "range": "5.23-12.547", "changes": -0.08, "companyName": "YieldMax Ultra Option Income Strategy ETF", "currency": "USD", "cik": null, "isin": "US88636J5276", "cusip": "88636J527", "exchange": "New York Stock Exchange Arca", "exchangeShortName": "AMEX", "industry": "Asset Management - Income", "website": null, "description": "The fund is an actively managed exchange-traded fund that seeks current income while providing direct and/or indirect exposure to the share price of select U.S. listed securities, subject to a limit on potential investment gains. It uses both traditional and synthetic covered call strategies that are designed to produce higher income levels when the underlying securities experience more volatility. The fund is non-diversified.", "ceo": null, "sector": "Financial Services", "country": "US", "fullTimeEmployees": null, "phone": null, "address": null, "city": null, "state": null, "zip": null, "dcfDiff": null, "dcf": 0, "image": "https://images.financialmodelingprep.com/symbol/ULTY.png", "ipoDate": "2024-02-29", "defaultImage": false, "isEtf": true, "isActivelyTrading": true, "isAdr": false, "isFund": false}, {"symbol": "WLGS", "price": 0.0533, "beta": 3.917, "volAvg": 65238439, "mktCap": 1692429, "lastDiv": 0, "range": "0.031-9.66", "changes": -0.0313, "companyName": "WANG & LEE GROUP, Inc.", "currency": "USD", "cik": "0001899658", "isin": "VGG9T22C1003", "cusip": null, "exchange": "NASDAQ Capital Market", "exchangeShortName": "NASDAQ", "industry": "Engineering & Construction", "website": "https://www.wangnlee.com.hk", "description": "WANG & LEE GROUP, Inc. operates as a construction contractor in Hong Kong and Mainland. The company engages in the contract engineering, installation, and out-fitting of electrical systems, mechanical ventilation and air-conditioning systems, fire safety systems, and water supply and sewage disposal systems for the public and private sectors. Its clients range from small startups to large companies. The company serves hospitals, schools and educational institute, hotels, residential development, commercial building, shopping arcade, HKSAR, public utilities, theme park, and data centers. WANG & LEE GROUP, Inc. was founded in 1981 and is based in Kwun Tong, Hong Kong. WANG & LEE GROUP, Inc. operates as a subsidiary of Wang & Lee Brothers, Inc.", "ceo": "Pui Lung Ho", "sector": "Industrials", "country": "HK", "fullTimeEmployees": "26", "phone": "852 2889 1313", "address": "Wing Tai Factory Building", "city": "Kwun Tong", "state": null, "zip": null, "dcfDiff": 1.37602, "dcf": -0.6251157240325634, "image": "https://images.financialmodelingprep.com/symbol/WLGS.png", "ipoDate": "2023-04-20", "defaultImage": true, "isEtf": false, "isActivelyTrading": true, "isAdr": false, "isFund": false}]